{
  "2054.0": {
    "summary": "The client greeted the agent with a formal 'Bonjour' and asked if they are looking for a dock (\"un ponton\")",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "2104.0": {
    "summary": "Client inquires about the possibility of paying $8,500 + tax for the 2024 service. The client is inquiring about the feasibility of the price.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "2235.0": {
    "summary": "Client Alexandre Goulet from Mathias Marine Sports is inquiring about the status of an ECU replacement part ordered from Polaris. They expect to finalize the order by the start of next week.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "unknown"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "7657.0": {
    "summary": "The client, De Mathias Marine Sports, is unhappy with the service charge for a winch installation. The client was quoted $1344 for the winch installation, which took 4 hours. The client mentions they would get a $280 discount if they purchase the winch. The client is comparing prices with and without the winch installation.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "9121.0": {
    "summary": "Client is trying to sell a ponton and is suggesting two different places to do so, with the agent responding to provide information.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "10997.0": {
    "summary": "The client, Mathias Marine, is a specialist in boat sales and offers various benefits to sell boats easily, including financing options, a large showroom, and strategic positioning on popular websites. The agent presents a commission-based sales structure and provides a link to a form to list the boat for sale.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales",
      "Logistics"
    ]
  },
  "11732.0": {
    "summary": "The client, De Mathias Marine Sports, is inquiring about a boat and trying to get information from the agent, Max. The client has sent multiple emails, including photos, and is waiting for a response. The agent eventually responds, providing the requested information.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "19758.0": {
    "summary": "Client inquires about the possibility of building an agressive pontoon version for the upcoming spring season and requests to be kept informed about the purchasing process.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales",
      "Support"
    ]
  },
  "22106.0": {
    "summary": "Client De Mathias Marine Sports (Kim Bessette) inquired about a recent order. The client expressed concern over the delayed delivery and requested an update on the status.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "frustrated",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Logistics",
      "Support"
    ]
  },
  "27976.0": {
    "summary": "Client De Mathias Marine Sports received an estimate for a boat compound, but mentioned a potential issue with the blue line becoming pale due to heavy oxidation. The client asked the agent to confirm the estimate and thanked them for their time.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "cautious",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "29177.0": {
    "summary": "The client, De Mathias Marine Sports (Marie-Andrée Gonthier), discussed estimated costs for repairing their boat with the agent, M. Sénéchal. The issues include a faulty fuel gauge and a malfunctioning Garmin depth sensor. The agent provided quotes for replacing the fuel gauge and depth sensor, totaling 997.38$ CAD, including labor and installation costs. The client agreed to proceed with the repairs. Additionally, the client inquired about the warranty coverage for the Garmin device, but was informed that it is no longer under warranty.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "30252.0": {
    "summary": "Client, De Mathias Marine Sports, confirms the payment amount of $2050 to be paid in cash.",
    "sentiment_overall": "Positive",
    "sentiment_details": {
      "client": "Positive",
      "agent": "Neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "41486.0": {
    "summary": "The client, De Mathias Marine Sports, inquired about selling their boats through Mathias Marine's services, highlighting their advantages such as exposure in a large indoor center, financing options, and strategic positioning on various websites. The agent presented a 3-forfait plan and commission rates.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "confident",
      "agent": "professional"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "41740.0": {
    "summary": "Client Normand requested to speak with agent Richard Bourque about a potential buyer for a 2550 Regal boat sale, and provided a link to a form for Richard to fill out.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "45342.0": {
    "summary": "The client asked about availability, then inquired about missing papers for a trailer from 'Fountain', and confirmed that the papers were left at the reception desk.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "45467.0": {
    "summary": "The client, De Mathias Marine Sports, discussed order details with the agent. The client initially requested information about suspensions and wanted to test a 36 before making a decision. The agent agreed to place an order for the requested items on Monday.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "45468.0": {
    "summary": "Client Mathias Marine Sports discussed with agent Mike Peg about a socket 32mm and an upgrade kit dt swiss for $34 and $209 respectively. They placed an order and confirmed delivery for the 22nd of September.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales",
      "Logistics"
    ]
  },
  "46278.0": {
    "summary": "Client envoie le formulaire pour le courtage de bateau, envoie courriel pour recevoir formulaire pdf et s'assurer qu'il a le bon courriel. Agent répond que le formulaire ne doit pas être rempli sur place et que le client doit plutôt l'envoyer rempli et signé.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "52001.0": {
    "summary": "Client (Marie-Andrée Gonthier) from Mathias Marine Sports informs Louis Letarte (President of Louis Letarte inc.) that the boat is finished, expresses gratitude and ends the conversation.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "57334.0": {
    "summary": "Client inquired about storage prices for their boat at Mathias Marine Sports and reserved a spot for the winter season. The client also expressed gratitude towards the agent for keeping a spot available.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "63078.0": {
    "summary": "Client and agent, Alexandre Goulet, discuss the details of a sale (part number 690, state of the bike, and chain sprocket). The client agrees to review the details the next day.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "64533.0": {
    "summary": "Client shared two links: https://mathias.tractiondk.com/traction/publicProduct/display/496380 and https://mathias.tractiondk.com/traction/publicProduct/display/495576.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Neutral",
      "agent": "Neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "65696.0": {
    "summary": "The client is not interested in exchanging on a brokerage at this time, but is open to considering storage of their boat with a potential brokerage deal in the future, as the season is coming to a close.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "67730.0": {
    "summary": "The client, Alexandre Goulet from De Mathias Marine Sports, sent a friendly reminder to the agent, asking if there was anything to discuss.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "68369.0": {
    "summary": "Client enquired about the sales status of a Larson boat, with the agent confirming it hasn't been sold yet, attributing the delay to a slow market.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "68624.0": {
    "summary": "Client confirmed an appointment to adjust his bike on November 14th, discussing the details with Mike, the bike department manager.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "68850.0": {
    "summary": "The client, De Mathias Marine Sports, had a brief conversation with an agent. The client sent a series of 'test' messages in French, inquiring about the delivery status, likely due to a misunderstanding or technical issue. The agent's responses were not provided, but it is assumed the agent attempted to clarify or address the issue.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "frustrated",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "69529.0": {
    "summary": "Client inquired about a boat on a trailer and expressed interest in a Cruiser Yacht, specifically 25-28 feet in length. The agent mentioned that they cannot facilitate a trade or brokerage due to bank financing restrictions. Client clarified their understanding and apologized for the inconvenience. Agent explained the bank's strict policies.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "somewhat disappointed",
      "agent": "helpful and informative"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "70959.0": {
    "summary": "Client received a quote for storage and commission from agent Mario for item 391, with possible exchange and financing options. Client thanked agent and asked for a response.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "72085.0": {
    "summary": "The client, De Mathias Marine Sports, discussed a used 2022 KTM 690 Enduro (referred to as 'te300i' and '890') with an agent, Nicolas Guignard. They inquired about the bike's price, potential trade-in for a Harley 883, and discussed a potential sale. The agent offered to check with a wholesaler and provided information about the bike's price and trade-in options.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Sales",
      "Support"
    ]
  },
  "73027.0": {
    "summary": "Client Nicolas Guignard from De Mathias Marine Sports contacted Raphael to inquire about an E-Bike, provided contact information, and scheduled a meeting for the next day. The conversation was professional and polite.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "73316.0": {
    "summary": "The client, De Mathias Marine Sports, confirmed an order for a second table with a post, with an estimated cost of $770.50 + tax. The client reminded the agent that they will be unavailable for facturation until September 28th and requested to be contacted via email instead of phone.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "polite and accommodating"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "73984.0": {
    "summary": "Client requested photos to be sent to a specific number and expressed gratitude.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "74677.0": {
    "summary": "The client, De Mathias Marine Sports, initiated a conversation with the agent, inquiring about a scout request and inquiring about assistance.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "friendly"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "79641.0": {
    "summary": "The client expressed gratitude for the agent's trust and asked for a document related to Four Winns brokerage.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "79712.0": {
    "summary": "Client De Mathias Marine Sports (Thomas Fernandez) initiated a call after receiving a service call from the agent, and is now seeking assistance.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "inquiry",
      "agent": "friendly"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "81104.0": {
    "summary": "The client, De Mathias Marine Sports, initiated a call on Monday, wishing the agent a good weekend. The conversation was brief and consisted of exchanging pleasantries.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "84593.0": {
    "summary": "The client, De Mathias Marine Sports, representing Dominic Sanfacon, initiated a call to conduct a survey.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "85358.0": {
    "summary": "Client sent a form with information for courtage and asked the agent to contact them if they have any questions.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "87943.0": {
    "summary": "Client is checking if the agent received an email about a previous request and is waiting for a response.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite",
      "agent": "none"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "88521.0": {
    "summary": "The conversation revolves around boat storage and sales. The client discusses pricing and promotions with the agent, ultimately deciding to purchase the boat.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales",
      "Logistics"
    ]
  },
  "89185.0": {
    "summary": "The client is thanking the agent, Jean-Pierre, for assistance and is providing a link to the required information.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "93272.0": {
    "summary": "Client Alexandre Goulet inquired about a 890 model at De Mathias Marine Sports, but ultimately opted for a different dealer in Vaudreuil due to proximity and a higher offer for his KLR. The agent, Yves, offered support and assistance.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "94343.0": {
    "summary": "Client expressed interest in a 701 enduro model, but is now unavailable. Agent is asked if they'd be interested in a KTM 690 enduro r instead.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "94951.0": {
    "summary": "Client Maxime Bernard from De Mathias Marine Sports inquired about a motorcycle purchase, inquiring if the agent still has the motorcycle and if they would like to upgrade or change models with a potential end-of-season deal.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "friendly",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "96034.0": {
    "summary": "Client is requesting correction on documents related to storage for their boat, specifically referencing a Glastron GX 195 boat with invoice number 83461, and requesting that the trailer be stored on their behalf.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "frustrated",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "96059.0": {
    "summary": "The client, Kim Bessette, is having difficulty accessing a payment link and is concerned about not receiving an invoice. The client sends a follow-up email on a Saturday to Guy Benfeito, indicating that they will send a scanned invoice on Monday if the issue is not resolved.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "concerned",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "96085.0": {
    "summary": "The client, De Mathias Marine Sports, received a confirmation email regarding the storage and preparation of their boat, a Princecraft Super Pro 176. The client is informed of their week of departure (Semaine 2, May 5-9), payment requirements, and procedures for picking up the boat. The client is also invited to complete a form for any additional work needed on the boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Sales",
      "Logistics"
    ]
  },
  "96166.0": {
    "summary": "Client De Mathias Marine Sports (Marie-Andrée Gonthier) reports a strap for the alternator is crying and inquires about availability and ordering process.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": " polite and informative",
      "agent": "not present in the conversation"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "96454.0": {
    "summary": "The conversation is about the availability of a boat, with the client being informed about the planned release date, preparation process, and notification schedule. The client is required to ensure their account balance is zero and to be present at the designated time for pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": " neutral (informative and polite) ",
      "agent": " neutral (informative and polite) "
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "97767.0": {
    "summary": "Client asked for a signed contract from buyers to be sent to their insurance, which the agent agreed to do upon her return on September 3rd. The agent then sent the contract to the client.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Finance"
    ]
  },
  "97885.0": {
    "summary": "Client receives updates on the status of a dossier, awaiting an estimate, and confirms the reservation of a 2023 item.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "98085.0": {
    "summary": "The client, Denis Belanger, received an update on the availability of his boat. The planned availability date is May 12, 2023, and the client must ensure their account balance is zero to avoid any issues. The agent informed the client that the delivery date might be delayed due to technical difficulties or weather conditions. The agent also mentioned that the client will receive two notifications: one when the preparation process begins and another when the boat is ready for pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "98232.0": {
    "summary": "The client, De Mathias Marine Sports, discussed their boat's issues with the agent, M. Hamel. The issues included a hard steering wheel, a power steering cooler leak, a power steering cable that needs to be replaced, and a mysterious noise. The client was also reminded of the importance of changing the anodes, filage, cap rotor, and bougies. The client accepted the cost of the power steering cooler and cable replacement but declined the service for the noise. They also asked about changing the oil and filter, washing the hull, and hibernating the boat. Additionally, they requested to have the propeller cleaned and the speed limiter unlocked due to algae buildup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "calm and informative, with a hint of assertiveness",
      "agent": "helpful and responsive, with a focus on resolving the client's issues"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "98587.0": {
    "summary": "Client is upset about a missed payment for a balance of $11,589.39 on invoice 81129 and requests payment via a link or by phone with a credit card number.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "frustrated",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Finance",
      "Support"
    ]
  },
  "98591.0": {
    "summary": "The client, De Mathias Marine Sports, contacted the agent about replacing discontinued lights under the swim area of their boat, and the agent offered to send an estimation for a suitable replacement.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "98875.0": {
    "summary": "The client, De Mathias Marine Sports, received the missing piece and will install it on the 13th. They also rescheduled their meeting to September 20th.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "100026.0": {
    "summary": "Client updates on the procedure with a notary, expecting a return on Monday for the transfer. Expresses gratitude and ends the conversation on a positive note.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "100300.0": {
    "summary": "Client Hao Huang is trying to sell a boat through Mathias Marine Sports, but is experiencing issues with the courtage contract system. Agent Alexandre Laramee is responding to these issues by explaining the problem with the system and promising to send the contract as soon as it is functional. The conversation also mentions the benefits of using Mathias Marine Sports for selling a boat, including a large indoor mega-centre, financing options, and a 90% success rate for boats sold through their courtage system.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "100542.0": {
    "summary": "Client inquired about their balance with Mathias Marine Sports, confirming it is indeed at zero. The agent provided a confirmation and wished the client a good weekend.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "101018.0": {
    "summary": "The client, Olivier Lebeau, is finalizing a dossier with the agent, M. Leclerc, and is provided with the necessary paperwork. The client questions the cost of a protection plan and is given a detailed explanation of the plan's benefits and cost.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "slightly negative, expressing concerns about the cost of the protection plan",
      "agent": "professional and helpful, providing detailed explanations and reassurances"
    },
    "concerned_departments": [
      "Support",
      "Finance"
    ]
  },
  "101539.0": {
    "summary": "The client received an update on the availability of their boat, FOUR WINNS HD, with a planned delivery date of 2023-05-31. The client was reminded to ensure their account is settled to zero to avoid any issues with the delivery. The agent also informed the client that the delivery date may vary depending on any difficulties encountered.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "101633.0": {
    "summary": "Client seemed frustrated and did not provide a clear question. The client shared a link but did not specify what they needed help with. The conversation appears to have ended abruptly.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "101683.0": {
    "summary": "Client, De Mathias Marine Sports, inquires about a valid survey and apologizes for not having one as mentioned. The agent apologizes for the inconvenience due to multiple cases and the client understands.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "apologetic"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "101747.0": {
    "summary": "Client expresses frustration about the lack of action on their boat, and mentions the current situation is not ideal, but hopes that the boat show starting tomorrow will bring a positive change.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "101910.0": {
    "summary": "Client Mathias Marine Sports (Alexandre Goulet) contacted Alex about potential work opportunities. Alex provided guidance on how to contact the Director of Sales and recommended sending a CV. The conversation was casual and focused on job opportunities, with Alex also discussing his personal hobby of motoneige riding.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales",
      "Logistics"
    ]
  },
  "102059.0": {
    "summary": "Client discusses upcoming notary appointment and an offer from Mathias Marine Sports. Client is excited about the offer and asks for guidance on the project.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "103600.0": {
    "summary": "Client, De Mathias Marine Sports, is awaiting offers from potential buyers and will respond to the agent as soon as possible.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "103996.0": {
    "summary": "The agent, Jean-Luc Trepanier, introduced Mathias Marine as a specialist in boat sales and offered several benefits for selling a boat through their service, including exposure in a large indoor centre, financing options, and high sales rates. The agent also explained their commission structure and provided a link to a form to list the boat for sale.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "104375.0": {
    "summary": "Client, Mathias Marine Sports, is deciding between kx and crf, but is being kept up to date and assured of assistance by the agent, Alexandre Goulet. The client expresses gratitude and appreciation for the agent's follow-up.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "104383.0": {
    "summary": "The conversation is a casual greeting and check-in between the client and agent. The client asks the agent to keep an eye on certain information and models, and the agent acknowledges their interest. There is no indication of any issues or concerns.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "104568.0": {
    "summary": "Client is waiting for an estimation from their colleague and appreciates the agent's patience.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "104953.0": {
    "summary": "Client (Maxime W Longtin) from De Mathias Marine Sports inquired about the possibility of canceling their account with Mathias Sports, thanking the agent for their time and expressing a positive tone.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "105110.0": {
    "summary": "Client De Mathias Marine Sports (Maxime Leclair) asked if the meeting for possession could be rescheduled.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "105743.0": {
    "summary": "Client Maxime Labbé, Directeur Financier chez Mathias Sports, discussed financing options with an agent, inquiring about the best time to call for a request and provided specific payment terms ($85/2 weeks for 36 months at 0.99% interest).",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "professional",
      "agent": "not provided"
    },
    "concerned_departments": [
      "Finance"
    ]
  },
  "105935.0": {
    "summary": "Client responded with a simple 'Oui', indicating a likely affirmative response.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": []
  },
  "106198.0": {
    "summary": "The client is following up on the preparation of their boat by Mathias Marine Sports. The client is informed about the preparation status and is asked to wait for a notification from the mechanic before presenting. The mechanic later notifies the client that the boat is ready and they need to leave the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "107498.0": {
    "summary": "The client, Richard Bourque, is satisfied with the work of Olivier, mentioning the service was quick and courteous, as it was during their previous interaction.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "very positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "107936.0": {
    "summary": "Client expressed agreement with a previous statement.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "108070.0": {
    "summary": "Client expressed frustration about delayed delivery of a motorcycle. The agent offered various solutions, including a price reduction. The client accepted the offer and made a purchase.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "frustrated, then satisfied",
      "agent": "helpful, accommodating"
    },
    "concerned_departments": [
      "Sales",
      "Logistics"
    ]
  },
  "108072.0": {
    "summary": "Client Mike Peg from De Mathias Marine Sports contacted the agent to inquire about the replacement of a Rockshox fork with a similar DVO fork. The client also requested to order two additional tools. Separately, the client Mike Peg contacted the agent again to report a delayed delivery of pedals and inquired about the status of the order. The agent informed the client that the pedals are $250 and that he needs to contact the supplier directly. The agent then contacted the client Francois to provide updates on his suspension issue and requested a photo of the bike's serial number for warranty purposes.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "negative",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "108819.0": {
    "summary": "Client expressed frustration due to delayed response, but resolved with agent Marion Guisiano. They confirmed an order and discussed delivery and payment details.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive (initially frustrated, but became relaxed and playful)",
      "agent": "positive (responsive and helpful)"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "109777.0": {
    "summary": "Client discussed laundry and fabric treatment with agent Marie Andree. Client inquired about job status and requested a deadline. Agent provided updates and acknowledged client's request.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "109811.0": {
    "summary": "Client requested an update on the sale of a motorcycle and the procedure to follow after Maxime W Longtin's return from vacation on September 1. The agent agreed to discuss further when available and set up a call for the next day.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "111305.0": {
    "summary": "The client received a notification from Mathias Marine Sports about the planned availability of their boat, a GLASTRON GLASTRON 245 GTD 6.2L/B3 MERC 2021. The planned date for the boat's availability is May 15, 2023, and the client must ensure their account balance is zero to avoid any delays. The client was also informed that the date might be adjusted due to technical difficulties or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "111325.0": {
    "summary": "The client, Mathias Marine Sports, received a notification from Chantal Hurtubise regarding the planned availability of their bateau, Larson Larson 195 LX 2014, scheduled for 2023-05-16. The client was reminded to ensure their account balance is zero to avoid any transfer issues and to be prepared for potential delays due to machine or temperature-related difficulties. The client was also informed about the notification process and the deadline to retrieve the bateau.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "formal",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics",
      "Support"
    ]
  },
  "111340.0": {
    "summary": "The client was informed about the scheduled availability of their boat, TAHOE TAHOE 215XI 2015, on 2023-06-01. The client was reminded to settle their balance to zero to ensure timely pick-up and was warned that the date might be adjusted due to technical difficulties or unfavorable weather conditions.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "111361.0": {
    "summary": "The client received a notification from Mathias Marine Sports about the scheduled date for their boat's availability, which is May 26th, 2023. The client needs to ensure their balance is zero to avoid any issues with the boat's transfer. The agency also warns about potential delays due to machinery or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "111375.0": {
    "summary": "The conversation is about the availability of a client's boat, with the agent providing a planned date for its release (2023-05-03) and instructions for preparation and pickup. The agent also sends follow-up notifications to inform the client of the process.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "111506.0": {
    "summary": "The client, Mathias Marine Sports, received an update from Claude Amatuzio regarding the availability of their bateau (SOUTH BAY PONTOONS SOUTH BAY PONTOONS S224CR 2018). The scheduled date of availability is May 5, 2023, and the client is reminded to ensure their account balance is zero to avoid any issues. The notification process and pick-up details are also outlined.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "informative",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "111513.0": {
    "summary": "The client has been informed about the scheduled availability of their boat. The agent has provided several notifications about the preparation and delivery of the boat, including a final notification to pick up the boat by the following Saturday. The client has expressed gratitude.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "111527.0": {
    "summary": "The client, Sebastien Arbic, was informed about the planned availability of his FOUR WINNS FOUR WINNS H220 2008 boat, which is scheduled for May 26, 2023. The agent explained the process of notification and the importance of having a zero balance to ensure a smooth handover. The client was also reminded to leave the premises by Saturday after the final notification.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Neutral",
      "agent": "Helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "111576.0": {
    "summary": "The client was informed about the scheduled availability of their boat, with a planned date of 2023-05-31. The client was reminded to ensure their account balance is zero to avoid any issues with the boat transfer. The agent also mentioned that the date might be adjusted due to machine or temperature-related difficulties. The client requested modifications to the boat and asked to be contacted as soon as possible.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "informative"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "111620.0": {
    "summary": "The client and agent discussed the planned release date of the client's bateau (BAYLINER BAYLINER 175BR 2005), which is scheduled for 2023-05-19. The agent emphasized the importance of a zero balance to ensure timely release and mentioned potential delays due to machinery or temperature issues. The client was informed about the notification process and was reminded to depart by the Saturday following the final notification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "111629.0": {
    "summary": "The conversation is about the availability date of a client's boat, GLASTRON 205 GTL 4.3 MPI/A MERCURY 2014. The agent, Mario Auger, informs the client that the boat will be available on May 26, 2023, and provides instructions on how to retrieve the boat and the importance of having a zero balance to avoid delays. The agent also mentions that the availability date might vary depending on certain difficulties.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "111640.0": {
    "summary": "Client received the planned availability date of their boat (AXIS AXIS A22 2014), scheduled based on their reserved week at autumn. The client must ensure their balance is zero to guarantee timely delivery. The pickup date may vary due to mechanical or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "111762.0": {
    "summary": "Client De Mathias Marine Sports requested to pick up their Larson boat on May 14, 2023, instead of the initially scheduled May 16, 2023. The agent explained the process of boat preparation and pickup, and the importance of having a zero balance to ensure a smooth transaction.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "inconvenient",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Logistics",
      "Support"
    ]
  },
  "111764.0": {
    "summary": "The client and agent exchanged information about the expected availability of a boat for rental. The agent provided a specific date for the boat's release, May 26, 2023, with instructions on how to proceed and the importance of having a zero balance to ensure timely release. The client repeated the same information, seemingly seeking confirmation.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "111803.0": {
    "summary": "Client Alex from Mathias requested a call about zx-10r, provided a phone number 450-600-7070.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "requesting assistance",
      "agent": "awaiting information"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "111900.0": {
    "summary": "Client De Mathias Marine Sports received a notification about the availability of their boat, a FOUR WINNS 215SS 2013, scheduled for 2023-05-08. The client was informed to ensure their account balance is zero before collecting the boat. The agent also warned that the date might vary due to difficulties such as machinery or temperature issues. The client was instructed to leave the premises by the following Saturday after the final notification.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Neutral",
      "agent": "Professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "111907.0": {
    "summary": "The conversation is about the availability of a boat, REGAL REGAL 2220 2009, which is scheduled to be ready on 2023-05-10. The client is informed about the need to pay off their balance and to wait for notifications from the mechanic before picking up the boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "111919.0": {
    "summary": "The client was informed about the planned date for the availability of their boat. The agent provided details about the preparation process and notification schedule. The client was reminded to ensure their account balance is zero to avoid any issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "112002.0": {
    "summary": "The client received a notification about the availability of their boat, with a scheduled release date of 2023-05-17. The client was reminded to ensure their account balance is zero to avoid any delays. The agent also notified the client that the release date may vary depending on mechanical issues or temperature.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite and formal",
      "agent": "helpful and professional"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "112053.0": {
    "summary": "Client sent photos to Rémi as discussed, requesting confirmation upon receipt.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Positive",
      "agent": "Neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "112119.0": {
    "summary": "The client was informed about the availability date of their boat, LUND LUND 1875 2021, which is scheduled for 2023-05-08. The client needs to ensure their account balance is zero to avoid any issues with the boat transfer. The agent also notified the client that the availability date might be subject to change due to machinery or temperature issues. The client was asked to leave the premises by the following Saturday after the final notification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "112120.0": {
    "summary": "The client responded with a simple acknowledgement ('Ok') without providing any additional context or details.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "112124.0": {
    "summary": "The conversation is about the preparation and delivery of a boat by Mathias Marine Sports. The client was informed about the delivery date, preparation process, and potential issues with the boat's system and a required repair. The agent provided an estimate for the repair and requested the client's authorization to proceed.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "112154.0": {
    "summary": "The client received an update on the availability of their bateau, scheduled for May 11th. The agent informed the client of the importance of having a zero balance to ensure the bateau is transferred to the departure list and provided instructions on the notification process.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "112180.0": {
    "summary": "The client was informed about the availability of their boat, scheduled for May 19th, and was reminded to settle their balance to ensure timely pickup. The agent also warned about potential delays due to machinery or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "112256.0": {
    "summary": "The client was informed about the scheduled date for the availability of their SEA DOO CHALLENGER 180 2006. The agent reminded the client to ensure their account balance is zero to avoid any issues with the boat transfer. The agent also mentioned that the date might be subject to change due to machine or temperature difficulties. The client was informed about the notification process and the need to leave the premises by the next Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite and cooperative",
      "agent": "informative and professional"
    },
    "concerned_departments": [
      "Support",
      "Finance"
    ]
  },
  "112299.0": {
    "summary": "Client received an update on the availability of their boat, with a scheduled date of 2023-05-16. Agent reminded the client to ensure their balance is zero and to be aware of potential delays due to machinery or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "112310.0": {
    "summary": "The client was provided with the scheduled availability date of their boat, with a warning that the date may vary due to potential difficulties and that they must ensure their account balance is zero to avoid any delays. The client was also informed of the notification process and the deadline to retrieve the boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "112326.0": {
    "summary": "The client asked to reschedule the boat launch date, but unfortunately, it was not possible. The client sent two polite messages to the agent, requesting to move the date forward, but the agent explained the fixed schedule and limitations.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "polite disappointment",
      "agent": "informative and neutral"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "112520.0": {
    "summary": "The client was informed about the planned availability date of their boat, GLASTRON 205 2020, which is scheduled for 2023-05-15. The client was reminded to ensure their balance is zero to secure the booking and was informed about the potential variation of the date due to technical difficulties. The client was also notified about the notification process and the need to leave the premises by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "112610.0": {
    "summary": "The client received an update on the availability of their boat, with a scheduled pickup date of 2023-05-04. The client is advised to have a zero balance and be prepared to leave the premises by the Saturday following the final notification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "112646.0": {
    "summary": "The client was informed about the scheduled availability of their boat, PRINCECRAFT PRINCECRAFT QUORUM 23XT 2016, which will be available on 2023-05-17. The client was reminded to have a zero balance and to be available to collect the boat within the specified timeframe. The agent provided a detailed explanation of the process and potential variations in the scheduled date.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Neutral",
      "agent": "Polite and Informative"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "112649.0": {
    "summary": "Client expressed gratitude with a brief acknowledgement (\"Ok merci\").",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "112669.0": {
    "summary": "The client received an update on the availability of their boat, with a planned date of 2023-05-31. The client is reminded to pay off their balance to secure their week of sailing and is notified about potential delays due to machinery or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "112742.0": {
    "summary": "The client, Geneviève Lafrenière, discussed the sale of a Sea Ray 260 sundancer with Richard Bourque, the director of sales at Mathias Marine Sports. They exchanged information about the boat's storage price and the client's interest in purchasing a forfait that would give her discounts on commission and storage. The client provided the necessary documents and the agent helped her understand the payment process. The conversation was mostly positive and productive, with the client expressing her gratitude and the agent providing helpful information.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "112812.0": {
    "summary": "The client was informed of the expected availability date of their BOMBARDIER SEADOO CHALLENGER 210 2010, scheduled for 2023-05-25. The agent reminded the client to ensure their account balance is zero to secure their reservation and warned that the date may vary due to technical issues or weather conditions. The client was also informed of the notification process and the need to depart the premises by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "112818.0": {
    "summary": "Client De Mathias Marine Sports (Guy Lanoue) called Agent Lagueux to discuss an issue with a part. The client made the call twice, with the same inquiry.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "not present"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "112836.0": {
    "summary": "The conversation is about the availability of a boat, specifically a FOUR WINNS FOUR WINNS HD 220 SD 6.2L/B3 2019, with a scheduled date of 2023-05-15. The client needs to ensure their account balance is zero and be available to pick up the boat by the following Saturday. The agent mentions that the date may vary due to mechanical issues or temperature.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Logistics",
      "Finance"
    ]
  },
  "112842.0": {
    "summary": "The client received a notification about the availability of their boat, with a planned delivery date of 2023-05-22. However, they mentioned that the boat has been sold and need to inform the new owner, as the company is responsible for the sale.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "negative (complaining about the sale of their boat and the need to inform the new owner)",
      "agent": "neutral (providing information and following up on the sale)"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "112868.0": {
    "summary": "The conversation started with a greeting from the client.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "unknown",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "112881.0": {
    "summary": "The client was informed about the availability date of their boat, FOUR WINNS 200 SS 5.0 MPI MERCRUISER 2014, which is scheduled for 2023-05-19. The client was also reminded to ensure their account balance is zero to secure their reserved week. The agent explained that the date may vary depending on encountered difficulties and provided a notification process for the client.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Logistics",
      "Support"
    ]
  },
  "112940.0": {
    "summary": "The conversation revolves around the delivery of a boat from Mathias Marine Sports. The client is informed of the planned delivery date (2023-05-02), and the agent explains the process of preparation and notification. The client is required to ensure their account is settled and to be present for the final notification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Logistics",
      "Finance"
    ]
  },
  "112962.0": {
    "summary": "The client, Alain Gaul, was informed about the availability date of his boat, a KAWASAKI KAWASAKI ULTRA 310X 2021, which was scheduled for May 3rd, 2023. However, the client expressed concerns about the date due to not having a trailer and a dock installation issue. He requested a postponement and plans to call the agent on Monday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "112967.0": {
    "summary": "The client was informed about the planned availability date of their boat (MAXUM MAXUM 2200 SR 1993), which is scheduled for 2023-05-03. The client was reminded to ensure their account balance is zero to secure the planned week of use and was warned that the date might vary due to machine or temperature issues. The client was also informed about the notification process and the deadline to leave the premises.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "112971.0": {
    "summary": "The client was informed by the agent about the scheduled availability of their boat, a GLASTRON 185 GTX 3.0L/A MERCURY 2017, on 2023-05-08. The client was reminded to ensure their account balance is zero to secure their week of water use and warned about potential delays due to machinery or temperature issues. The agent thanked the client for their collaboration and wished them a good season.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "112979.0": {
    "summary": "La conversation concerne la vente d'un ponton Legend en courtage. Le client, Nancy Godbout, est intéressée par la vente mais a des préoccupations concernant le prix et la commission. L'agent, Richard Bourque, lui explique les différents forfaits et les coûts associés. Le client est finalement satisfait des informations et décide d'aller de l'avant avec l'achat d'une remorque.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive (initialement neutre, puis positive après que les préoccupations du client aient été résolues)",
      "agent": "professional"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "112997.0": {
    "summary": "Client expressed gratitude with a simple 'Parfait merci'.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113006.0": {
    "summary": "The client received an update on the availability of their boat, with a planned release date of June 2nd, 2023. The agent informed the client to ensure their balance is zero to ensure a smooth pickup process. The client was also warned that the release date might vary due to technical difficulties.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113031.0": {
    "summary": "The client was informed about the availability date of their boat, which is scheduled for May 2nd, 2023. The client was also reminded to settle their balance and to be prepared to pick up the boat on the designated date. The agent provided updates on the preparation process and notified the client to wait for the next notification from the mechanic.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113070.0": {
    "summary": "The client was informed about the scheduled availability of their boat, with a specific date and time provided. The agent emphasized the importance of having a zero balance to ensure the boat is transferred to the departure list, and warned that the date might be subject to change due to difficulties such as machinery or temperature issues. The client was also reminded to collect the boat by the specified Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113085.0": {
    "summary": "The agent from Mathias Marine Sports communicated with the client about the scheduled availability of their boat. The date of availability is May 5th, 2023. The agent emphasized the importance of having a zero balance to ensure a smooth pickup process. The client received notifications about the process and was advised to vacate the premises by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113185.0": {
    "summary": "The client (Mathias Marine Sports) received a notification from Guillaume Denax regarding the planned availability of their boat (MOOMBA MOOMBA MOJO 23 2016). The boat's release date is scheduled for 2023-05-09, and the client must ensure their account balance is zero to avoid any issues with the transfer. The client is also informed that the date may vary by a working day due to potential difficulties. The agent has instructed the client to leave the premises by the following Saturday after the final notification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113188.0": {
    "summary": "The client was informed of the planned availability date of their boat, which was scheduled based on their previously booked autumn week. The agent reminded the client to ensure their balance is zero to secure the week's reservation, and to be aware of potential delays due to machinery or temperature issues. The client was also notified of the notification process and the deadline to depart with their vehicle.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113205.0": {
    "summary": "Client responded with a brief 'Ok merci' and 'Bon week end à vous!' which translates to 'Thank you okay' and 'Have a good weekend!' indicating a polite and friendly closing of the conversation.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113230.0": {
    "summary": "The client was informed about the scheduled availability of their boat (BAYLINER BAYLINER 175 2006) on May 19, 2023, with the condition that their balance must be zero for the boat to be transferred to the departure list. The client will receive notifications when the process starts and when the boat is ready for pickup. The client must depart by the Saturday following the last notification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113243.0": {
    "summary": "The client, De Mathias Marine Sports, received an update from Andre Pisarski regarding the availability of their Nissan 370z 2016. The expected handover date is 2023-04-28. The client is advised to ensure their account balance is zero to secure the handover and to be prepared to leave the premises by the following Saturday. The agent communicated a detailed plan and warned of potential delays.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113268.0": {
    "summary": "Client De Mathias Marine Sports discussed the logistics of delivering boats to a salon, suggesting either transporting them to the salon directly or having the client visit at the quai de l'horloge, and then proceeding to Montebello if necessary.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "113298.0": {
    "summary": "The client received updates on the availability of their boat from Mathias Marine Sports, including the planned delivery date (2023-05-03) and procedures for preparation and notification. The client was informed to ensure their account balance is zero and to be present after receiving a notification from the mechanic.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "113301.0": {
    "summary": "The client was informed about the planned availability date of their REGAL REGAL 2220 FASDECK 2010 boat, which is scheduled for May 23rd, 2023. The client was reminded to ensure their account balance is zero to avoid any issues with the delivery. The agent also warned that the availability date might change due to technical difficulties or other factors.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "113327.0": {
    "summary": "The client received a notification from Mathias Marine Sports regarding the planned delivery date of their boat, PRINCECRAFT PRINCECRAFT SUPER PRO 176 1995, which is scheduled for 2023-05-04. The client must ensure their balance is zero to secure the delivery. The delivery date may vary due to machine or temperature difficulties. The client will receive two notifications: one for the start of the delivery process and another when the boat is ready for pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113341.0": {
    "summary": "The client, Micheline Dubé, is confirming the planned date for the boat's launch (BÉLUGA) and requesting confirmation of the details. The agent, Mathias Marine, provided the planned date (2023-05-29) and outlined the necessary steps and considerations for the launch process.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113393.0": {
    "summary": "The client and agent exchanged messages regarding the availability of a boat from Mathias Marine Sports. The client was informed about the planned date for the boat's delivery, which was scheduled based on the reserved week in autumn. The agent provided details about the preparation process, including notifications to be sent by the mechanic, and instructed the client to ensure their account balance is zero to avoid any issues. The conversation was professional and informative, with the agent providing clear instructions and the client showing interest in the process.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "informed",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113399.0": {
    "summary": "The client was informed about the scheduled date for the availability of their boat, which was planned according to their reserved week at autumn. The client received multiple updates about the preparation and notification process, including the importance of having a zero balance to ensure the boat's transfer. The agent provided detailed information and reminders about the process, including the possibility of date changes due to machinery or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113456.0": {
    "summary": "Client expressed gratitude with a smiling face emoticon.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113461.0": {
    "summary": "The client received an update on the availability date of their boat, with the planned date being May 18, 2023, and was reminded to ensure their balance is zero before the boat is transferred. The client was also informed about the potential delay of a working day due to machinery or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "113472.0": {
    "summary": "The client, Jonathan, is inquiring about the sale of his boat. He sends two emails to Richard Bourque, one requesting the estimation of the boat's value and the other sharing his research about the boat's potential value, around $150,000-$159,000 CAD, and expressing concerns about the price being a bit high.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "113475.0": {
    "summary": "The client, Mathias Marine Sports, received a notification from Marie Turmel regarding the availability of their boat, GLASTRON GLASTRON 205 GT 4.3 TKS/A MERC 2014. The planned availability date is 2023-05-31, and the client is advised to ensure their account balance is zero to avoid any issues. The client is also notified that the availability date may vary depending on encountered difficulties. The client is informed about the notification process and the expected departure time.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "113476.0": {
    "summary": "The client receives an update from Mathias Marine Sports regarding the availability of their boat. The date of availability is set for 2023-05-01, and the client is reminded to ensure their account balance is zero to prevent any issues. The client is also informed about the preparation process and the notifications they will receive. The conversation is a standard notification and does not contain any negative or positive sentiment.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support",
      "Sales",
      "Logistics"
    ]
  },
  "113477.0": {
    "summary": "The client received a notification about the availability of their boat, with a planned date of May 4th, 2023. The client was informed that their solde must be zero for the boat to be transferred to the list of departures, and that the date might vary due to technical difficulties. The client called for further clarification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113612.0": {
    "summary": "The client was informed about the planned availability date of their boat, which was rescheduled due to a previous communication. The client needs to ensure their account balance is zero to avoid any issues, and the availability date may vary depending on technical difficulties. The client was also reminded about the process and notification system for the boat's preparation and pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113616.0": {
    "summary": "The client received a notification about the availability date of their boat, FOUR WINNS FOUR WINNS 190LE 2011, scheduled for 2023-06-01. The client was informed to ensure their account balance is zero to avoid any issues and that the date might be subject to change due to machine or temperature difficulties. The agent also provided details about the notification process and the need to vacate the premises by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "113622.0": {
    "summary": "The client was informed about the expected availability date of their boat, CHAPARRAL CHAPARRAL 244 2011, which is scheduled for 2023-05-25. The client was reminded to ensure their account balance is zero to avoid any issues with the boat's pickup. The client was also notified that the availability date may change due to mechanical or temperature issues, and will receive two notifications before the boat is ready for pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113651.0": {
    "summary": "The client received a notification regarding the availability of their boat (REGAL REGAL 2500 LSR 2000) on 2023-05-04. The client was informed to ensure their account balance is zero to secure their reserved week. The agent also mentioned that the availability date may vary due to technical or temperature issues, and the client will receive two notifications before collection.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113655.0": {
    "summary": "The client, Charles Laplante, received a notification from Mathias Marine Sports regarding the availability of his boat. The scheduled date is 2023-05-12, and he needs to ensure his account balance is zero to avoid any issues. The agent informed him of the process of retrieving the boat, including notifications and a deadline to vacate the premises.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113669.0": {
    "summary": "The client received a notification about the planned availability of their boat, with a specific date and instructions for preparation. The agent explained the importance of having a zero balance and the potential for date changes due to technical difficulties. The conversation is a routine update on the boat's availability.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Neutral",
      "agent": "Polite"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113682.0": {
    "summary": "The client has been informed about the planned availability of their boat, with a scheduled date of 2023-05-01. The client is reminded to ensure their account balance is zero to avoid any issues with the boat transfer. The agent has provided updates on the preparation and notification process, and has thanked the client for their collaboration.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113704.0": {
    "summary": "The client, De Mathias Marine Sports, has been informed about the scheduled availability of their boat, a SCARAB 195 SCRAB ROTAX 4TEC 250 ECT 2018. The date is set for 2023-05-18, and the client is advised to ensure their account balance is zero to guarantee the scheduled pickup. The client is also notified that the date might vary by one business day due to potential difficulties.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "informative",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113748.0": {
    "summary": "The client received a notification about the availability of their boat, CROWNLINE rasor 2009, with a planned date of 2023-05-12. The client was informed to ensure their account balance is zero and that the date may vary due to technical difficulties. The client was also notified about the process of receiving the boat, including two notifications from Mathias Marine Sports.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113752.0": {
    "summary": "The client was informed by Mathias Marine Sports about the scheduled availability of their boat, with a planned date of May 2nd, 2023, and a reminder to settle their account to avoid any issues. The client was also notified about the preparation process and the need to wait for further instructions from the mechanics.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "Neutral, with a hint of slight frustration due to the repetition of information and the need to wait for further instructions.",
      "agent": "Polite and informative, with a friendly tone and a desire to collaborate with the client."
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "113753.0": {
    "summary": "The client, Williams Carriere, was provided with the expected availability date of their bateau (May 23, 2023) and informed about the necessary precautions to ensure timely pickup. The agent, a representative of Mathias Marine Sports, reminded the client to settle their balance and to leave the premises by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "113763.0": {
    "summary": "The client (Mathias Marine Sports) received a notification from the agent (Roxane Bruneau) regarding the expected availability of their boat (GLASTRON GLASTRON 245 GTL 350 MPI/B3 2014). The agent informed the client about a potential delay in the boat's availability due to various reasons and reminded them to ensure their account balance is zero to secure the boat's handover. The client received a formal and polite notification from the agent.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113767.0": {
    "summary": "The client (De Mathias Marine Sports) received updates on the availability of their boat, including a scheduled pickup date and instructions to settle their account before the pickup. The agent confirmed the preparation of the boat and advised the client to wait for a notification from the mechanic.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113768.0": {
    "summary": "The client was informed about the scheduled availability date of their boat, with a detailed explanation of the process and notifications they would receive. The client was also reminded to pay their balance in full to ensure a smooth transaction. The agent thanked the client for their collaboration and wished them a good season.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113769.0": {
    "summary": "The agent, Fatou Diaby, is informing the client, De Mathias Marine Sports, of the scheduled availability of their boat, FORD DRWHURRICANE 31B 2009. The boat is expected to be available on 2023-04-26, but the client needs to ensure their account balance is zero to proceed. The agent also mentions that the date may vary due to potential issues and provides a process for notification and pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113770.0": {
    "summary": "Client expressed gratitude to the agent.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113786.0": {
    "summary": "The client received an update on the availability of their SEA RAY SUNDANCER 2004 boat, scheduled for May 10, 2023. They were informed to ensure their account balance is zero to avoid any issues and that the date might be subject to change due to mechanical or temperature difficulties. The client also received notification instructions and a deadline to pick up the boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "113791.0": {
    "summary": "The client received a notification about the availability of their boat. The boat is expected to be available on 2023-05-08, but the exact time is not specified. The client needs to ensure their account balance is zero to avoid any issues with the boat transfer. The date might be subject to change due to technical difficulties or other issues. The client will receive two notifications: one when the preparation process starts and another when the boat is ready for pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "informed",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113794.0": {
    "summary": "Client received an update on the scheduled availability of their boat, with a planned date of 2023-05-05. The client must ensure their account balance is zero to secure their week-long rental. The agent warned that the date may be adjusted due to various difficulties. The client acknowledged and thanked the agent, and the conversation ended with a good wish.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113795.0": {
    "summary": "The conversation is about the client picking up their boat from Mathias Marine Sports. The agent provides the client with the expected date of availability, which is May 1st, 2023, and explains the process of preparation and notification. The client responds with gratitude and confirmation.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113796.0": {
    "summary": "The agent, Jacques Bernier, is informing the client, De Mathias Marine Sports, about the planned availability date of their boat, a STARCRAFT SEASTAR 1700 2005. The date is set for 2023-05-05 and is subject to change based on technical difficulties or weather conditions. The agent is advising the client to ensure their account balance is zero before picking up the boat, and that they must leave the premises by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "no sentiment mentioned",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113798.0": {
    "summary": "The client is scheduling a pickup for a delivery on Saturday, May 20. The conversation is unclear due to a response with only a single word.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113799.0": {
    "summary": "The client was informed about the planned availability date of their SEA RAY 180 2001 boat, which is scheduled for May 4th, 2023. The client is reminded to have a zero balance to ensure the boat is transferred to the departure list and to be prepared to pick up the boat with their vehicle after receiving a second notification. The client is also aware that the date might be adjusted due to machine or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113802.0": {
    "summary": "The client (Mathias Marine Sports) received a notification from the agent (John Mcnaught) about the planned availability of their bateau (FOUR WINNS h180 2013) on 2023-05-26. The agent reminded the client to ensure their balance is zero to guarantee the scheduled week of use and warned that the date might be changed due to technical difficulties. The client was also informed about the notification process and the deadline to leave the premises.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113806.0": {
    "summary": "The client, De Mathias Marine Sports, was informed about the planned availability of their Monterey 258 ss 2017 boat. The boat is expected to be available on 2023-05-30 and the client was reminded to ensure their account balance is zero before pickup. The client was also warned that the date might vary and was informed about the notification process.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113807.0": {
    "summary": "The client was informed about the planned release date of their boat. The release date was scheduled based on the week they booked for the fall. The client was also warned that the date could vary depending on difficulties encountered with the machinery or temperature. The agent provided a two-step notification process and confirmed that the client must leave the premises by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "calm",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113811.0": {
    "summary": "Client inquired about the availability of their boat, initially scheduled for May 17th. They requested to postpone the date. The agent explained the process and provided details about notifications and the need to settle the account before the boat can be released. The client agreed to call a technical advisor between 10am and 4pm the next day.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "calm and polite",
      "agent": "professional and informative"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113812.0": {
    "summary": "The client was informed about the predicted availability date of their boat, REGAL 2300 2013, which is scheduled for 2023-05-04. They were reminded to ensure their balance is zero to secure their spot and were warned that the date might change due to machine or temperature difficulties. The client was also informed about the notification process and the departure deadline.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113815.0": {
    "summary": "The client received an update on the availability of their boat, with a scheduled delivery date of 2023-05-11. They were advised to ensure their account balance is zero to secure the delivery slot and that the date may be subject to change due to technical difficulties. The client was promised notifications when the process begins and when the boat is ready for pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113829.0": {
    "summary": "The client was informed about the planned availability date of their rented boat, CROWNLINE CROWNLINE 180 2005, which is scheduled for 2023-05-08. The client was reminded to ensure their balance is zero and to be aware that the date may be adjusted due to technical difficulties. The client was also informed about the notification process and the deadline to leave the premises.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Neutral",
      "agent": "Professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113836.0": {
    "summary": "The client is expecting their boat to be available for pickup on May 18, 2023. The process involves two notifications: one when the boat is being prepared for pickup, and another when it's ready to be collected. The client must ensure their account balance is zero to avoid any issues. The agent provided a clear explanation of the process and warned the client about potential delays.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "concerned",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "113884.0": {
    "summary": "The conversation is about the availability of a boat from Mathias Marine Sports. The client was informed about the planned availability date, which is May 1st, 2023. The agent reminded the client to ensure their account balance is zero to confirm the pickup. The client was also notified that the preparation of the boat would be completed soon and they would receive a notification from the mechanic.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113913.0": {
    "summary": "The client greeted the agent in French and asked if they were looking for a boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "not present"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "113946.0": {
    "summary": "The client, Richard Senechal, was informed about the availability date of his BENNINGTON BENNINGTON 22 SLX 2015 boat. The date is set for 2023-05-11, and he needs to ensure his balance is zero to avoid any issues. The agent, Mathias Marine Sports, also informed Richard that the date might be subject to change due to mechanical or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "113984.0": {
    "summary": "Client checked in to see if a new boat had been found, expressed gratitude and bid farewell.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "114031.0": {
    "summary": "The client received a notification about the planned availability of their boat, with a specific date of May 26th, 2023. The client was informed to ensure their account balance is zero to guarantee the boat's availability on their scheduled week. The agent also mentioned potential delays due to machinery or temperature issues and provided a notification schedule.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "114062.0": {
    "summary": "The client received a notification about the planned availability of their boat, including the date (2023-05-30 04:00:00.0), the importance of having a zero balance, and the possibility of date changes due to technical difficulties. The client was also informed about the notification process and the deadline to leave the premises.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "friendly"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "114099.0": {
    "summary": "The client, Stephane Deschenes, CEO of SMT Hautes Technologies Inc, authorizes Benoit Moquin of Thomas Marine to retrieve his boat for mechanical modifications. The conversation also includes a notification from Mathias Marine regarding the planned launch date of the client's Carver C-52 2021.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive (authorization and professionalism)",
      "agent": "professional (neutral tone and informative)"
    },
    "concerned_departments": [
      "Support",
      "Sales",
      "Logistics"
    ]
  },
  "114100.0": {
    "summary": "The client has been informed of the scheduled availability of their boat. The date is set to May 24th, and the client must ensure their balance is zero to avoid any issues. The client will receive notifications when the process starts and when the boat is ready for pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114102.0": {
    "summary": "The client was informed about the anticipated availability date of their boat, MALIBU MALIBU WAKESETTER 23 LSV 5.7L 2014. The date was scheduled based on their reserved week in autumn. The client was reminded to ensure their account balance is zero to secure the boat's availability and was notified that the date might vary due to technical issues or temperature. The client was also informed about the notification process and the deadline to retrieve the boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics",
      "Support"
    ]
  },
  "114111.0": {
    "summary": "The client received an update on the expected availability of their boat. The agent informed the client that the boat is scheduled to be available on May 22, 2023, and provided instructions on how to prepare for pickup, including ensuring a zero balance and being aware of potential delays.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114112.0": {
    "summary": "Client inquired about purchasing a boat on Facebook Marketplace and asked the agent if they could help with saving taxes. The agent explained that saving taxes is not possible when there's financing involved, but the boat is still a good model.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "frustrated",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "114125.0": {
    "summary": "The client, De Mathias Marine Sports, sent two confirmation messages to Eric Arseneault for a vehicle pickup on 2023-02-06 09:00. The client provided a link to confirm presence and mentioned payment details for the Ranger Crew XP 1000 Premium.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114133.0": {
    "summary": "The client, De Mathias Marine Sports, confirmed the pickup date of their GLASTRON 160 GTX 1990, scheduled for May 15, 2023, with a possible variation of one business day due to mechanical or temperature difficulties. They also confirmed they will collect the boat after May 25th.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114165.0": {
    "summary": "The client was informed about the scheduled availability of their boat, with a planned date of 2023-05-30. The agent reminded the client to ensure their account balance is zero to guarantee the scheduled delivery. The client was also warned that the date might be subject to change due to technical difficulties or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114168.0": {
    "summary": "The client received a notification from Mathias Marine Sports regarding the availability of their BOMBARDIER SEADOO 230 CHALLENGER 2009. The expected availability date is June 1st, 2023, and the client is required to ensure their account balance is zero to secure their reservation. The notification also mentions potential delays due to machinery or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114176.0": {
    "summary": "The client asked about the opening date of the St-Ours lock, and the agent responded with an email about the scheduled launch date of their boat. The agent provided detailed information, including the launch date, precautions, and procedures to follow.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "114201.0": {
    "summary": "The client received updates on the availability of their boat, including a scheduled release date, preparation process, and notification sequence. The agent confirmed the details and provided instructions for pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "informative",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "114247.0": {
    "summary": "The client was informed about the scheduled availability of their boat, PREMIER PONTOONS 240 SUNSATION 150L MERCURY 2017, with the planned date set for 2023-05-17. The client was reminded to have a zero balance to ensure their week of water activities is respected and was warned that the date might change due to technical difficulties. The client was also notified about the process of picking up their boat after preparation.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Logistics",
      "Support"
    ]
  },
  "114254.0": {
    "summary": "Client, Alexandre, asked to reschedule his boat launch by 2-3 weeks due to a blocked access to his dock. The agent, Mathias, provided a scheduled launch date of May 1st, 2023, with a note that the date could vary by a workday depending on encountered difficulties. The conversation discusses the importance of a zero balance and the process of taking possession of the boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114261.0": {
    "summary": "The client received a notification from Mathias Marine Sports about the planned availability of their boat. The date of availability is set for 2023-05-08, and the client is reminded to ensure their account balance is zero to avoid transfer issues. The client is also warned that the date may be subject to change due to technical difficulties or other factors.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "friendly"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114283.0": {
    "summary": "The client was informed about the availability date of their boat, with a scheduled date of 2023-05-09. The agent explained the importance of having a zero balance to ensure a smooth pickup process and warned that the date might be subject to change due to technical difficulties. The client confirmed they would be present at the opening on 2023-05-09.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Logistics",
      "Support"
    ]
  },
  "114306.0": {
    "summary": "The conversation is about the availability of a boat, specifically the MOOMBA MOOMBA OUTBACK 21 2013. The client is informed about the planned date of availability, which is May 17th, 2023, and is reminded to ensure their account balance is zero to avoid any issues. The client is also notified that the date may vary due to technical difficulties. The agent provides instructions on when to expect notifications and when to pick up the boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "114308.0": {
    "summary": "The client is being informed about the planned availability date of their boat, which is scheduled for June 2nd, 2023. They are reminded to ensure their account balance is zero to avoid any issues with their boat transfer. The client is also notified that the availability date may vary depending on any difficulties encountered with the machinery or temperature.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114368.0": {
    "summary": "The client was informed about the scheduled availability of their boat (CROWNLINE CROWNLINE 21 2010) on 2023-05-08, with a reminder to have a zero balance to ensure the reservation is honored. The client was also warned that the date might be adjusted depending on technical difficulties and was provided with a notification process.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114371.0": {
    "summary": "The conversation is about the availability date of a boat, GLASTRON 205 GT 4.3 TKS/A MERCURY 2014, which is scheduled for May 26, 2023. The client needs to ensure their account is in good standing to collect the boat. The date may vary depending on encountered difficulties.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "114389.0": {
    "summary": "The client, Mathias Marine Sports, was informed by Normand Hébert of the boat's availability date. The boat, AUTRE PRINCECRAFT PRO176 2002, is scheduled to be available on 2023-05-11. The client was reminded to settle their account to zero to ensure a smooth handover process. The agent informed the client that the availability date may be subject to change in case of mechanical or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114394.0": {
    "summary": "The conversation is about confirming a rendez-vous for a vehicle R40 Fly on 2024-09-24 13:00. The client receives two identical messages, however, the client sends a message stating that the vehicle's possession has been cancelled.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "114409.0": {
    "summary": "The client initiated a conversation with a simple greeting, 'hey', but there is no additional context or information to provide a detailed summary.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114423.0": {
    "summary": "The client was informed about the expected availability date of their boat. The agent provided a detailed plan, including notifications and a deadline for the client to pick up the boat. The client was reminded to settle their account before the boat is released. The agent also warned the client that the availability date might be affected by technical difficulties.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "114427.0": {
    "summary": "The conversation is about a boat delivery from Mathias Marine Sports. The client is informed about the delivery date, preparation process, and notification schedule. The client is reminded to clear their balance and be present on the designated date.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114463.0": {
    "summary": "The client was informed about the planned availability date of their boat (PRINCECRAFT PRINCECRAFT HUDSOND LX 19 2013) scheduled for 2023-05-04. The client was reminded to ensure their account balance is zero to avoid any issues and to be prepared for potential delays due to machinery or temperature issues. The client was also notified about the notification process and the expected date to leave the premises.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "114489.0": {
    "summary": "The client, De Mathias Marine Sports, received an update on the availability of their boat, Chaparral Chaparral Extreme 224 2010, with a planned delivery date of 2023-05-12. The client is advised to ensure their account is settled to avoid any issues with the handover. The agent also notified the client about the possibility of a one-day delay due to potential difficulties with the machinery or temperature.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114561.0": {
    "summary": "The conversation is about the availability of a boat, GLASTRON GLASTRON 205GT 2013, with a planned release date of 2023-05-22. The client is informed about the importance of a zero balance to ensure a smooth process and is warned about potential date variations due to machinery or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "114667.0": {
    "summary": "The client received a notification about the availability of their boat, with a scheduled date of 2023-05-18. The client was informed to ensure their account balance is zero to secure the reservation and that the date may be subject to change due to mechanical or temperature issues.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Neutral",
      "agent": "Polite"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114744.0": {
    "summary": "The conversation is about the availability of a client's boat, PRINCECRAFT PRINCECRAFT HUDSON DLH 2014, with a planned delivery date of 2023-05-10. The client needs to ensure their account balance is zero for the boat to be transferred. The agent also mentions that the date may vary due to difficulties and provides a notification process for the client.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Positive (friendly and polite language used)",
      "agent": "Positive (polite and informative language used)"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "114774.0": {
    "summary": "The client received an update on the availability of their VIP 2400 VINDICATOR 2001 boat, scheduled for May 10th. The client was reminded to settle their account to zero to ensure timely pickup and was informed of potential delays due to machinery or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114897.0": {
    "summary": "The client received a notification about the availability of their boat, with a planned date of 2023-06-02. They were informed to ensure their account balance is zero to avoid any issues. The agent also mentioned that the date might vary due to technical difficulties and that the client will receive notifications when the process starts and when the boat is ready for pickup. The client was also reminded to leave the premises by the Saturday following the second notification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "calm",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "114901.0": {
    "summary": "The client was informed about the planned availability date of their boat, which is scheduled for 2023-05-01. The agent warned the client about the importance of having a zero balance to ensure the boat is transferred to the departure list. The client was also informed about the preparation process and the notifications they will receive.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "114922.0": {
    "summary": "The client and agent are discussing the availability of the client's boat, a BOMBARDIER SEA DOO WAKE 210 2012, with a planned delivery date of 2023-05-25. The agent reminds the client to ensure their account balance is zero to avoid any issues with the delivery. The agent also mentions that the delivery date may be subject to change due to mechanical or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114950.0": {
    "summary": "The client, De Mathias Marine Sports, received a notification about the expected availability of their boat, Princecraft 176P SE 17 2008, scheduled for 2023-05-09. The client is advised to ensure a zero balance to guarantee the boat's transfer. The agent highlights potential delays and provides a step-by-step process for the boat's preparation and pickup.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Professional",
      "agent": "Helpful"
    },
    "concerned_departments": [
      "Support",
      "Sales",
      "Logistics"
    ]
  },
  "114966.0": {
    "summary": "The client, Christian Giard, is being informed about the planned availability date of his BOMBARDIER CHALLENGER 230 2008. The date is set for 2023-05-12, taking into account the reserved week in autumn. The client is reminded to ensure their account balance is zero to avoid any issues with the bateau transfer. The agent also warns that the date might be adjusted due to mechanical or temperature difficulties.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "114996.0": {
    "summary": "The client was informed about the scheduled availability of their boat, with a planned date of 2023-05-16. They were reminded to ensure their account balance is zero to avoid any issues with the boat transfer. The client was also notified about the possibility of date changes due to mechanical or temperature issues, and were informed about the notification process.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "115065.0": {
    "summary": "The client was informed about the planned availability of their boat, with a scheduled date of May 15, 2023. The agent reminded the client to ensure their account balance is zero to secure the reservation and warned that the date may be adjusted due to mechanical or temperature difficulties. The client was notified about the process and timeline for the boat's preparation and pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "friendly and informative"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "115108.0": {
    "summary": "The conversation is about the availability date of the client's boat, BAYLINER BAYLINER 245SB 2008. The agent informs the client that the boat will be available on 2023-05-24 and provides instructions for pickup, including a zero balance requirement and notification process. The client repeats the message verbatim, suggesting a potential misunderstanding or confirmation.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "115109.0": {
    "summary": "The client mentioned a reservation with captain P for the 21st of May, but no further details or context were provided.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "115132.0": {
    "summary": "Client was informed about the scheduled availability of their boat. The agent explained the process of preparation and notification, and the client was advised to ensure their account balance is zero to avoid any issues. The agent also mentioned that the scheduled date might be subject to change due to mechanical or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite and informative"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "115182.0": {
    "summary": "The client was informed about the scheduled availability of their boat (BAYLINER BAYLINER 235 2012) on May 24th, with a reminder to ensure their account balance is zero to avoid any issues. The agent also notified the client that the date might be subject to change due to mechanical or temperature issues. The client was assured that they will receive notifications when the process of preparing the boat for pickup begins and when it is ready for collection.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "115208.0": {
    "summary": "The client is being informed about the availability date of their boat (GLASTRON GLASTRON 195 GLS BR 2012) which is set for 2023-05-15. The client is advised to ensure their account balance is zero to avoid any issues. The agent also mentions that the date may be subject to change due to technical difficulties or weather conditions. The client is informed about the notification process and the deadline for picking up the boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics",
      "Support"
    ]
  },
  "115210.0": {
    "summary": "The client was informed about the scheduled availability of their BOMBARDIER SEADOO SPARK 2015, with a planned date of 2023-05-25. The client was reminded to ensure their account balance is zero to avoid any issues, and that the date might be subject to change due to machine or temperature difficulties. The client was also notified about the notification process and the deadline to leave the premises on the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Logistics",
      "Finance"
    ]
  },
  "115227.0": {
    "summary": "The client, Christian Faucher, received a notification about the upcoming availability of their boat, CENTURION CENTURION 21 2010, scheduled for May 5th. The agent emphasized the importance of having a zero balance to ensure the boat is transferred to the departure list and reminded the client to vacate the premises by the following Saturday. The client received a duplicate message, likely a notification or auto-response.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "115231.0": {
    "summary": "The client was informed of the planned availability date of their boat, with the date being May 19, 2023. The client was asked to ensure their balance is zero to avoid any issues with the boat's transfer. The agent also mentioned that the date might be subject to change due to machinery or temperature difficulties.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "115346.0": {
    "summary": "The client, André Roy, had a meeting scheduled for May 12th, which was rescheduled to the same date with Sylvain Tardif. The client requested to verify and correct the meeting in the agenda. The conversation also discussed the details of a boat launch planned by Mathias Marine Sports, including the date, time, and procedure.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "115357.0": {
    "summary": "Client is on a trip in Europe returning on May 22nd and their quai will be installed by the end of May.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "115412.0": {
    "summary": "Client expresses frustration and disappointment about a delayed water release in June, feeling it's taking too long.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "115414.0": {
    "summary": "The conversation is about the planned availability of the client's boat, a SEA RAY sundeck 220 2006, on May 5th, 2023. The client is informed about the importance of having a zero balance to ensure the boat is transferred to the departure list. The conversation also mentions potential delays due to machinery or temperature issues. The client is notified about two upcoming notifications and the need to leave the premises by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "115416.0": {
    "summary": "The client has booked a bateau and is receiving updates on its availability. He is concerned about leaving the bateau in storage over the summer and requests that any repairs be made before it is returned. He is also selling the bateau and requests to be kept updated on its availability.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics",
      "Support"
    ]
  },
  "115434.0": {
    "summary": "The client is being informed about the planned availability of their boat. The agent is stating that the date has been planned according to the client's reservation in the fall. The client is reminded to ensure their balance is zero to avoid any issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "115444.0": {
    "summary": "Client confirmed the transport details with Sylvain for Thursday, May 18. The client was informed about the planned date for their boat's 'mise à l'eau' previously scheduled for May 9. The client agreed to the transport and confirmed they have no issues.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "115447.0": {
    "summary": "The conversation is about a boat pickup schedule. The agent informed the client of the planned availability date of the boat, which was scheduled based on the client's reserved week in autumn. The client was also reminded to ensure a zero balance to avoid any issues with the boat transfer. The agent warned that the date might vary by a working day due to potential difficulties such as machinery or temperature issues. The client was notified of the process and the need to leave the premises by the Saturday following the last notification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "115546.0": {
    "summary": "The client was informed of the scheduled availability of their boat. The agent provided a specific date (2023-05-31) and emphasized the importance of ensuring a zero balance to avoid any issues. The client was also notified that the date may vary due to technical difficulties and was informed about the notification process and departure procedure.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "115673.0": {
    "summary": "The client was informed of the expected availability date of their boat, FOUR WINNS FOUR WINNS H260 2016, which is scheduled for 2023-05-26. The agent ensured the client that their week of water use will be respected, provided they have a zero balance. The client was also warned that the date may vary due to mechanical or environmental issues, and they must leave the premises by the following Saturday after receiving the final notification.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Positive",
      "agent": "Professional"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "115681.0": {
    "summary": "The client was informed about the scheduled availability of their boat, SCARAB 215 ID TWIN ROTAX 4TEC 200 ECT 2018, with a planned date of 2023-05-18. The client was reminded to ensure their account balance is zero to avoid any issues with the boat's transfer. The agent also mentioned that the date might be adjusted due to potential difficulties and provided a notification process for the client to follow.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "informative",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Logistics",
      "Support"
    ]
  },
  "115685.0": {
    "summary": "The client and agent discussed the availability of a boat, specifically the GLASTRON 225 GT 5.0 MPI/A MERCURY 2014, with a planned availability date of 2023-05-15. The agent reminded the client to ensure their account balance is zero to avoid any issues with the boat's transfer. The conversation also covered the notification process and the client's responsibility to collect the boat within a specified timeframe.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "115709.0": {
    "summary": "The client received a notification about the expected availability of their boat, REGAL REGAL 2100 2013, on 2023-05-10, with instructions to ensure their account balance is zero before the scheduled date, and to be aware that the date may be subject to change due to technical difficulties.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Neutral",
      "agent": "Polite"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "115710.0": {
    "summary": "The client received a notification about the scheduled availability of their boat, MAXUM MAXUM 2300 SCR 1999, with a planned date of 2023-05-09. They were informed about the importance of having a zero balance to ensure their scheduled week of use is respected, and that the date may vary depending on encountered difficulties. The client was also notified about the process of receiving notifications when the boat is prepared for pickup and the deadline to leave the facility.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "informative",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Logistics",
      "Support"
    ]
  },
  "115722.0": {
    "summary": "The client received a notification about the planned availability of their boat, STINGRAY STINGRAY 235 2011, which is scheduled for 2023-05-05. The client needs to ensure their account balance is zero before the boat can be transferred and that they pick it up by the following Saturday. The agent warned that the date may vary due to technical difficulties or weather conditions.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "115724.0": {
    "summary": "Client is unable to put their boat in the water due to high water levels and requests to delay the process.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "115819.0": {
    "summary": "Client received information about Mathias Marine's boat sales services, including exposure in a large indoor center, financing options, and strategic positioning on multiple websites. The client is considering the proposal and will respond if they decide to proceed.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "115843.0": {
    "summary": "The client has been informed about the planned availability date of their boat, which is scheduled for May 17th, 2023. The agent reminds them to ensure their balance is zero to secure their booked week of water sports and warns about possible date variations due to technical or environmental issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "115920.0": {
    "summary": "Client Marc-Henri Cayouette expresses interest in a boat but is not satisfied with the provided model. He thanks the agent for the link and specifies his preferences for a different layout and design. The agent, Richard Bourque, sent the link to the client as a suggestion and inquired about the client's availability on Saturday.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "disappointed",
      "agent": "polite"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "115978.0": {
    "summary": "The conversation revolves around the availability of a customer's boat, a DINGHY SP360, with various dates and notifications discussed. The customer initially confirms a pickup date but later mentions selling the boat and requests to have Kim, an agent, coordinate with the buyer. The agent, Kim, confirms receiving the request and offers to call the new owner.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "slightly frustrated, but polite and appreciative",
      "agent": "professional and helpful"
    },
    "concerned_departments": [
      "Sales",
      "Logistics"
    ]
  },
  "116000.0": {
    "summary": "The client was informed about the scheduled availability of their boat, GLASTRON GLASTRON 209 GT 2009, on 2023-05-15. The agent reminded the client to ensure their account balance is zero to secure the reserved week and warned about potential date variations due to machine or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116019.0": {
    "summary": "The client was informed about the availability of their boat on 2023-05-05. The client was reminded to ensure their account balance is zero to secure their booking, and was warned that delays might occur due to machinery or temperature issues. The agent provided a clear step-by-step process for the pickup of the boat, including notifications and a deadline for the client to leave the premises.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "informative",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116033.0": {
    "summary": "The client received an update on the availability of their boat, scheduled for May 29, 2023, with the reminder to settle their account balance to zero before the handover. The client was also informed about potential delays in case of machine or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116046.0": {
    "summary": "The client, Mathias Marine Sports, received a notification about the planned availability of their boat, a FOUR WINNS FOUR WINNS HD 240 SD 6.2L/B3 2019, scheduled for May 22nd. The client was reminded to ensure their account balance is zero to ensure timely delivery, and was also informed that the date might be subject to change due to technical difficulties or weather conditions.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116063.0": {
    "summary": "The conversation revolves around the scheduled delivery of a boat from Mathias Marine Sports to Jean-François Pilon. The agent provides updates on the preparation and notification process, while the client requests a specific delivery date and time.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "slightly frustrated",
      "agent": "professional and helpful"
    },
    "concerned_departments": [
      "Logistics",
      "Sales"
    ]
  },
  "116102.0": {
    "summary": "The client, De Mathias Marine Sports, received an update on the planned water entry date for their second pontoon river boat. The date, May 26, is subject to change by one working day due to potential issues such as machinery or temperature problems. The client is required to ensure their account balance is zero before the water entry date to secure their spot. After the water entry, they will receive two notifications, the first after the initial inspection and the second after the usage check, indicating it's time to take possession of the boat. The client must vacate the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116103.0": {
    "summary": "Client De Mathias Marine Sports has been informed of the scheduled launch date of their CRUISERS YACHTS CRUISERS YACHTS 380 EXPRESS 2012, planned for 2023-05-25, contingent on machine and temperature conditions. The client is advised to ensure their account is settled before the launch date to avoid delays. A two-notification system will be used to confirm the launch and subsequent handover of the vessel. The client must depart the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116107.0": {
    "summary": "The client was informed about the planned availability date of their boat, with specific details about the process, notifications, and requirements for the pickup. The conversation is about a scheduled boat delivery on May 9th, 2023.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales",
      "Logistics"
    ]
  },
  "116158.0": {
    "summary": "The client De Mathias Marine Sports received an update on the planned water date for their Chaparral 180 SSI 2008 boat, scheduled for 2023-05-05. The client is advised to ensure their balance is zero before the water date to avoid any issues. The agent provided detailed instructions on the process, including notifications and the necessity to collect their boat by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116159.0": {
    "summary": "The client, De Mathias Marine Sports, received a notification from the agent, Lucy Romanoff, regarding the scheduled availability of their BMW 328i 2007. The date of availability is April 28th, 2023, and the client must ensure their account balance is zero to proceed. The agent warned that the date may vary due to potential difficulties with machinery or temperature.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116175.0": {
    "summary": "The client, De Mathias Marine Sports, has been informed about the scheduled water date for their boat, AUTRE AZIMUT 60 FLY 2009, which is planned for 2023-05-08. The client is advised to ensure their balance is zero before the scheduled date, otherwise their boat will not be transferred to the water list. The client will receive notifications when the boat is put in the water and when they can take possession of it. The client is expected to leave the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite",
      "agent": "friendly"
    },
    "concerned_departments": [
      "Support",
      "Logistics",
      "Finance"
    ]
  },
  "116253.0": {
    "summary": "The client is being informed about the availability of their boat, GLASTRON GLASTRON 205 GTS 4.5L / ALPHA 2020, which is scheduled for May 3rd. The client needs to ensure their account balance is zero for the boat to be transferred. The agent will notify the client when the preparation is started and completed. The client needs to pick up the boat by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "116255.0": {
    "summary": "Client was informed about the scheduled availability of their REGAL regal 24 2012 boat, scheduled for 2023-05-04. The client was reminded to ensure their balance is zero and that they will receive notifications when the boat is ready for pickup. The client was also informed about the importance of leaving the premises by Saturday following the final notification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116295.0": {
    "summary": "The client, De Mathias Marine Sports, received an update on the planned launch date of their Jeanneau 440 Sport 2009 boat, scheduled for 2023-05-16. The client was reminded to ensure their balance is zero before the launch and to be prepared to take possession of the boat after verification by a technician. The client is expected to leave the marina by the Saturday following the launch.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116344.0": {
    "summary": "The client, De Mathias Marine Sports, received a notification from Jean-Serge Gestion JSV inc. regarding the upcoming water test for their AUTRE JET CAT 55 2009 on 2023-05-01. The notification includes instructions to ensure their account balance is zero before the water test, and to be prepared to take possession of the boat after a second notification from a technician.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116346.0": {
    "summary": "De Mathias Marine Sports client inquires about the upcoming water testing date for their boat, GLASTRON GLASTRON 205 GT 4.5L/ALPHA 2018, and asks if they can receive their balance via text message.",
    "sentiment_overall": "Positive",
    "sentiment_details": {
      "client": "Neutral (mainly seeking information and clarification)",
      "agent": "Positive (friendly, informative, and polite)"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116363.0": {
    "summary": "The client was informed about the scheduled availability of their boat. They were provided with a specific date (2023-05-16) and warned about the importance of having a zero balance to ensure the boat is transferred on time. The client was also notified about potential delays and the process of notifications they will receive when the boat is ready.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116392.0": {
    "summary": "Client De Mathias Marine Sports confirmed a scheduled launch date for their Bayliner BAYLINER 185 BR 2004 on 2023-05-24. The client was informed about the importance of having a zero balance before the launch and the procedures for pickup after the launch.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Logistics",
      "Support"
    ]
  },
  "116395.0": {
    "summary": "The client, De Mathias Marine Sports, has been informed about the planned launch date for their EBBTIDE EBBTIDE 188 2012, scheduled for 2023-05-12. The client is advised to ensure a zero balance to secure their spot. They will receive two notifications: one after the boat is launched and a second after a technician has completed the usage checks. The client must pick up their boat by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116411.0": {
    "summary": "The client, De Mathias Marine Sports, is given a scheduled date for their boat's launch, which may be adjusted based on potential difficulties. The client is instructed to ensure their account balance is zero to secure their launch spot and will receive two notifications, one after inspection and one to take possession of the boat.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116412.0": {
    "summary": "The client was informed about the availability date of their bateau (CHAPARRAL SSE 205 2000) scheduled for 2023-05-25. The agent reminded them to settle their account to avoid any delays and to be prepared to pick up the bateau by the next saturday after the last notification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116439.0": {
    "summary": "The client was informed about the planned availability date of their boat, which was scheduled based on their reserved week in autumn. The agent reminded the client to have a zero balance to ensure a smooth process and warned that the date might vary depending on mechanical difficulties or temperature. The client was also informed about the notification process and the expected departure time.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116450.0": {
    "summary": "The conversation is about a scheduled boat pickup date. The client is informed that the boat will be available on 2023-05-09, and they need to ensure their account balance is zero to proceed. The client is also warned that the date may be subject to change due to technical difficulties.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Logistics",
      "Finance"
    ]
  },
  "116456.0": {
    "summary": "The client, De Mathias Marine Sports, has been informed about the scheduled launch date for their boat, AUTRE RIVIERA M470 2008. The launch date is set for 2023-05-26, but is subject to change by one business day due to potential difficulties. The client is reminded to settle their account to ensure a smooth handover process. The agent thanks the client for their cooperation and wishes them a good season.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116566.0": {
    "summary": "The client was informed about the planned availability date of their boat, BOMBARDIER SPEEDSTER 2006, scheduled for 2023-05-25. The client was reminded to ensure their account balance is zero before the boat is released, and that the date might be adjusted due to technical difficulties or weather conditions.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116567.0": {
    "summary": "The client, De Mathias Marine Sports, was informed about the scheduled launch date for their FOUR WINNS 278V 2008 boat, which is set for 2023-05-22. The agent explained the importance of having a zero balance to ensure the launch date is respected and provided details about the notification process, including taking possession of the boat and leaving the marina by the following Saturday.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Neutral",
      "agent": "Positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116569.0": {
    "summary": "The client is De Mathias Marine Sports, and the conversation is regarding the scheduled launch of their boat. The launch date is planned based on the client's reserved week, but may vary by a working day due to potential difficulties. The client must ensure their account balance is zero to be placed on the launch list. Once the boat is launched, the client will receive a notification to pick it up, and they must depart the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116590.0": {
    "summary": "The client, De Mathias Marine Sports, received an update on their previously scheduled boat launch date. The agent, Eric Francoeur, informed the client that the launch date is scheduled for 2023-05-04, but may vary by one workday due to potential issues. The agent reminded the client to ensure their account balance is zero to secure their launch spot and provided instructions on what to expect after the launch, including notifications and a deadline to pick up the boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116593.0": {
    "summary": "The client was informed about the availability date of their boat. The date was scheduled based on the reserved week in autumn. The client was also notified about the preparation process and the need to settle their account to ensure timely delivery. The client was assured that the process could vary by one working day due to technical difficulties and was informed about the notification process.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116606.0": {
    "summary": "The client received a notification about the planned availability of their boat, with a scheduled date of 2023-05-19. The client is required to ensure their account balance is zero to avoid any delays. The notification also mentions that the date may vary due to technical difficulties and that they will receive two notifications before the boat is ready for pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "informative",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116608.0": {
    "summary": "The client, De Mathias Marine Sports, received an update on the planned launch date of their BAVARIA BAVARIA S45 COUPE VOLVO IPS600 2021. The date is scheduled for 2023-05-08, but may vary by one working day due to potential difficulties. The client is required to ensure their account is settled before the launch date. Once the launch is complete, the client will receive a notification to present themselves, and a second notification will be sent after a technician has performed the necessary checks.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "116613.0": {
    "summary": "The client was informed about the planned availability date of their boat, CROWNLINE CROWLINE E6 2014, which is set for 2023-05-08. The client needs to ensure their account balance is zero to avoid any issues with the boat transfer. The date may be subject to change due to technical difficulties or weather conditions.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116617.0": {
    "summary": "The client is receiving an update on the availability of their boat, with a planned release date of May 11th, 2023. The client is informed of the importance of having a zero balance to ensure the boat is transferred on time, and that the release date may vary due to technical difficulties. The client is also reminded of the process of notifications and the requirement to leave the premises by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116618.0": {
    "summary": "The client, De Mathias Marine Sports, received an update from the agent, Carmel Chaput, regarding the planned water test date for their FOUR WINNS 260 HORIZON V8-350C/DI/DP 2018. The date is set for 2023-05-22, but may vary by one working day due to potential difficulties. The client must ensure their account balance is at zero to secure their water test date. Once the water test is completed, the client will receive notifications to pick up their boat within a specified timeframe.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116631.0": {
    "summary": "The client received a notification about the availability of their BOMBARDIER RXT-300 2020 boat. The boat is expected to be available on 2023-05-12, and the client must ensure their account balance is zero to avoid any issues. The client also received instructions on how to proceed with the boat's retrieval and was reminded to leave the premises by the following Saturday after receiving a final notification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116633.0": {
    "summary": "The agent from Mathias Marine Sports sent a notification to the client about the scheduled availability of their boat, a GLASTRON GT 205 2013, on 2023-05-15. The client is required to ensure their account balance is zero to guarantee the scheduled week of use. The agent warned that the date might be subject to change due to machinery or temperature issues. Notifications will be sent to the client when the process starts and when the boat is ready for pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116634.0": {
    "summary": "The conversation discusses the availability of a boat, specifically a MASTER CRAFT X46 2015, with the client being informed of the expected date of availability and the preparation process. The client is also reminded to ensure their account balance is zero to confirm the boat handover.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite and cooperative",
      "agent": "professional and informative"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "116636.0": {
    "summary": "The client, De Mathias Marine Sports, received a scheduled launch date for their bateau, AUTRE HARRIS CROWN 25 2007, on 2023-05-05. They were informed about the importance of having a zero balance to ensure the scheduled launch date. The client responded, stating they are no longer the owner of the bateau and requesting the name of the new owner.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral/negative (requesting clarification and correcting the situation)",
      "agent": "positive (providing information and instructions)"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116642.0": {
    "summary": "The client (De Mathias Marine Sports) received a notification about the planned launch date of their boat (SILVERTON SILVERTON 41 SEDAN diesel 2003) which is set for May 22nd. The client needs to ensure their balance is zero before the launch date and will receive two notifications after the boat is launched.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116644.0": {
    "summary": "Client Patrick Allaire inquired about the prices of accessories for a KTM 890 Adventure R 2023 with Alexandre Goulet from Mathias Marine Sports. The client received a quote and a follow-up email with a submission, but had some issues with availability of certain parts.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "116657.0": {
    "summary": "Client De Mathias Marine Sports is informed about the planned launch date of their boat, which is scheduled for 2023-05-17. The client is advised to ensure their account balance is zero to confirm the launch, and to follow instructions from the marina after receiving notifications.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116666.0": {
    "summary": "The client, De Mathias Marine Sports, received an update on the scheduled launch date of their ADVANTAGE ZODIAC COQUE RIGIDE T-YAMAHA 2002. The planned launch date is 2023-05-11, but it may vary by one working day due to potential difficulties. The client is advised to ensure their account balance is zero to secure their launch spot. After launch, they will receive two notifications: the first upon completion of initial checks and the second to take possession of the boat. The client must vacate the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116673.0": {
    "summary": "The client was informed about the planned availability of their SEA RAY sea ray 225 2500, scheduled for 2023-05-23. The client was reminded to ensure their account balance is zero and that they must vacate the premises by the Saturday following the final notification. The agent provided a clear explanation of the process and thanked the client for their collaboration.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116675.0": {
    "summary": "The client, De Mathias Marine Sports, provided an update on the availability of their boat, a 2016 Chaparral SSX. They confirmed the boat will be available on May 2, 2023, but warned that the date may vary by one business day due to potential difficulties. They outlined the process for pickup, including notifications from the mechanic and a deadline to leave the premises by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "professional",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116678.0": {
    "summary": "Client De Mathias Marine Sports receives a scheduled launch date for their SUN TRACKER sun tracker 2012. The agent informs them that the date is subject to change and that they must ensure their account balance is zero before the launch. The agent also outlines the process for taking possession of the boat, including receiving notifications and departing the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116680.0": {
    "summary": "The client, De Mathias Marine Sports, received a notification from Jules Mathieu regarding the planned launch date of their RINKER RINKER CAPTIVA 226 2012. The launch date is set for 2023-05-23, but may vary by one working day due to potential issues. The client is required to ensure their account balance is zero before the launch to secure their spot. Post-launch, they will receive notifications to pick up their boat, and must vacate the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116692.0": {
    "summary": "The client was informed about the scheduled availability of their boat (BAYLINER BAYLINER 285 2007) on 2023-05-25. The agent explained the importance of a zero balance to ensure the boat can be transferred and warned about potential delays due to mechanical issues or temperature. The client was also notified about the notification process and the need to leave the premises by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "informative",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Logistics",
      "Support"
    ]
  },
  "116731.0": {
    "summary": "Client Mathias Marine Sports discussed purchasing a used boat under 20 years old for $65,000 with agent Alexandre Laramee. Client is looking for a first-time boat to use as a weekend getaway and potential future vacations. Client is interested in Larson, Bayliner, and Glastron models but wants to see them in person. Agent provided links to three boat models and offered to show them to the client when available. Client and agent coordinated a visit to the store but had scheduling conflicts.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "116751.0": {
    "summary": "The client inquired about the availability of their boat, and was informed by the agent about the planned release date, which was rescheduled due to difficulties. The client then asked to postpone the pickup to May 20th, which was not explicitly confirmed by the agent.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116764.0": {
    "summary": "The client was informed about the planned availability date of their boat (FOUR WINNS FOUR WINNS 240 H 2007) for the upcoming season. The agent provided details about the preparation process, including notifications and a deadline for pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "116774.0": {
    "summary": "Client, Alexandre Goulet from De Mathias Marine Sports, is requesting a callback from the agent, Andre, to discuss something when the agent has two minutes free.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Polite",
      "agent": "Awaiting"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116778.0": {
    "summary": "Client De Mathias Marine Sports received an update on the scheduled launch date for their boat, a Chaparral Signature 280 2008, planned for 2023-05-19. The agent emphasized the importance of having a zero balance to ensure the launch is respected and provided instructions on the notification process and checkout procedures.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "116779.0": {
    "summary": "The client, De Mathias Marine Sports, received an update on the planned launch date of their Princecraft 21 boat. The launch is scheduled for June 12th, and the client is advised to ensure their account balance is zero to avoid any issues. The client is also informed about the notification process and the requirement to leave the marina by the next Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite and cooperative",
      "agent": "informative and professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116780.0": {
    "summary": "The client, De Mathias Marine Sports, received an update on their boat's scheduled launch date, which is planned for 2023-05-16. The client is required to have a zero balance to ensure their week of launch is respected. The agent provided instructions on notifications and pickup procedures, including a second notification after a technician's inspection and a deadline to leave the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116796.0": {
    "summary": "The client, De Mathias Marine Sports, received a notification from Lyne Darche regarding the scheduled launch date of their MANITOU MANITOU 23 AURORA LE VP RF 2022. The client was informed about the possible variation in the launch date due to various factors such as machinery issues or temperature. The client was also advised to ensure their account balance is zero before the launch date to confirm their week for the launch. The client will receive two notifications after the launch, one after the verification of the boat and another to take possession of the boat, with a deadline to leave the marina the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116835.0": {
    "summary": "Client is experiencing tax issues with their company, Ferme 9459, and is seeking to adjust the price of a product to compensate for a loss of $1237.90. The client discusses possible solutions with the agent, including adding the cost to a VTT or adjusting the product price to $9237.90. The agent provides a total balance of $22699 and acknowledges the client's issue.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "concerned",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support",
      "Finance"
    ]
  },
  "116840.0": {
    "summary": "The client, De Mathias Marine Sports, received an update on the planned launch date of their PRINCECRAFT VECTRA 21 2018 boat, scheduled for 2023-05-30. The client is informed about the importance of having a zero balance to ensure their week of launch is respected. The client is also notified about the process of taking possession of the boat, including a first and second notification, and the need to vacate the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "informative/instrumental",
      "agent": "polite/approachable"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116844.0": {
    "summary": "The client, De Mathias Marine Sports, received an update on the scheduled availability of their boat. The planned delivery date is 2023-05-04, subject to certain conditions such as the client's balance being zero and potential difficulties in the maintenance process. The agent explained the process of notification and the importance of the client departing the premises on time.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116909.0": {
    "summary": "The client, De Mathias Marine Sports, received an update on the planned launch date for their Bayliner Bayliner 175 BR 2012. The launch date is set for 2023-05-24, and the client is advised to ensure their account balance is zero to proceed with the launch. The client will receive two notifications: the first upon the launch and the second after a technician has completed the usage checks, indicating it's time to take possession of the boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116917.0": {
    "summary": "The client received a notification about the planned availability of their boat, with a scheduled date of 2023-05-30. The client needs to ensure their balance is zero to secure their week-long reservation. The agent informed the client about the preparation process, including notifications and pickup details.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116922.0": {
    "summary": "The client was informed about the planned availability date of their boat, REGAL FASDECK 26 XR. The agent confirmed that the date was set based on the client's reserved week in autumn. The agent also reminded the client to ensure their account balance is zero to avoid any issues with the boat's transfer. The client was informed about the potential changes in the availability date due to various difficulties and the notification process for the boat's preparation and pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116925.0": {
    "summary": "The client, De Mathias Marine Sports, receives an update on the delivery date of their MANITOU MANITOU 23 OASIS BAR. The planned delivery date is May 29, 2023, but is subject to change due to technical difficulties. The client must ensure their account is settled before the delivery date to avoid any issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "116936.0": {
    "summary": "The client, De Mathias Marine Sports, was informed about the planned water test date for their CARVER 450 2001, scheduled for 2023-05-17. The client was also reminded to ensure their balance is zero before the water test and to follow the procedures for receiving the boat. The client is expected to take possession of the boat and leave the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116962.0": {
    "summary": "Client De Mathias Marine Sports received an update on the planned water entry date for their FOUR WINNS HORIZON 290 TWIN 6.2L/BRAVO 3 boat, scheduled for 2023-05-22. The agent informed them to ensure a zero balance on their account for the water entry to be processed, and provided details on the notification process and expected timeline for taking possession of the boat.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116983.0": {
    "summary": "The client, De Mathias Marine Sports, received an update on the planned launch date of their BAVARIA S33 HT D3-220 EVC 2022. The launch date is set for 2023-05-09, but may be adjusted by one business day due to potential issues with the machinery or temperature. The client is required to ensure their account balance is zero before the launch date. Once the launch is complete, the client will receive a notification and must collect their boat by the following Saturday.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Neutral",
      "agent": "Positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "116993.0": {
    "summary": "The client received a notification about the availability of their boat, scheduled for May 11, 2023. The client is informed to ensure their account balance is zero to avoid any issues. The availability date may vary due to machine or temperature difficulties. The client will receive two notifications: one when the process of taking the boat out of storage starts and another when the boat is ready for pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "117043.0": {
    "summary": "The client, De Mathias Marine Sports, received an update on the planned launch date of their Bayliner 2655, scheduled for May 5th, 2023. The client was informed to ensure their account balance is zero before the launch and to await two notifications from the marina before taking possession of the boat. The marina's operations would continue the following week, except for seasonal residents.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "117109.0": {
    "summary": "The client received a notification from Mathias Marine Sports about the availability of their boat. The boat is expected to be available on 2023-05-25, and the client needs to ensure their account balance is zero to avoid any issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "117113.0": {
    "summary": "The client, De Mathias Marine Sports, was informed about the planned launch date of their Carver C37 2018, scheduled for 2023-05-01. They were advised to ensure their account balance is zero before the launch to avoid any issues. The client was also informed about the notification process after the launch and the expected departure date from the marina.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Logistics",
      "Support"
    ]
  },
  "117118.0": {
    "summary": "The client (Renaud Ferdais) was informed about the availability date of his Yamaha 192sx, planned according to his autumn reservation. The agent reminded him to settle his account to ensure timely delivery and that any issues might cause a delay of one working day. The client was also informed about the notification process and the need to leave the premises by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Logistics",
      "Finance"
    ]
  },
  "117121.0": {
    "summary": "The client was informed about the scheduled availability of their boat, with a planned date of 2023-05-24. The agent reminded the client to ensure their account balance is zero to secure the boat's availability. The client was also notified about potential delays due to machinery or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "117151.0": {
    "summary": "The client, De Mathias Marine Sports, provided the client with a scheduled date of 2023-05-26 for the DORAL doral 250se 2000's launch. The client was also informed about the importance of having a zero balance to ensure the launch date is respected. The client interacted with the agent for further information and to confirm the launch preparation. The agent informed the client about the preparation process and the notification they will receive once the bateau is ready.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite and helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "117172.0": {
    "summary": "The client was informed about the scheduled delivery date of their boat, regal 35 sport coupe, for May 17th. They were also reminded to ensure their account balance is zero before the delivery to avoid any issues. The agent provided detailed instructions on the notification process and the required actions after the boat is delivered.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "117204.0": {
    "summary": "The client was informed of the scheduled availability of their boat (PRINCECRAFT vogue xt 2022) on 2023-05-30. The agent reminded the client to ensure their account is paid in full to avoid any issues with the boat's release. The agent also warned that the scheduled date might be subject to change due to machinery or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "117247.0": {
    "summary": "The client was informed about the scheduled availability of their boat (KAWASAKI JT1500KLF 2022) on 2023-05-29, with precautions about payment balance and potential delays due to technical issues. The agent reminded the client to be aware of the departure process and the need to vacate the premises by Saturday after the final notification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite/professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "117258.0": {
    "summary": "Client Brian Desmarteau inquired about the availability of his boat, which was initially scheduled to be released on 2023-05-01. He mentioned that he will be out of town until May 13 and requested to pick up the boat on May 15. The agent, Kim Bessette, confirmed that she will release the boat on the 15th and sent a confirmation text.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "patient and polite",
      "agent": "helpful and accommodating"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "117263.0": {
    "summary": "The client, Barry Desmarteau, was notified of the expected availability date of their boat, May 2nd, due to the scheduled week in autumn. However, the client had previously communicated that they would not be able to collect their boats until May 15th. The client requested a change in the collection date and provided alternative dates of May 14th, 15th, or 16th. The agent, Kim Bessette, agreed to accommodate the change and planned to release the boat on May 15th.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "117264.0": {
    "summary": "The client received an update on the scheduled launch date of their boat (2023-05-26), which may be subject to change due to technical difficulties. They were also reminded to pay their balance and present themselves after receiving a second notification from the marina. The client's cooperation is appreciated, and they are informed to leave the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "117274.0": {
    "summary": "The client, Pierre-Yves Guay, received a notification from Mathias Marine Sports regarding the planned launch date of his boat, which is scheduled for 2023-05-24. He was advised to ensure his account balance is zero to avoid any issues. The client will receive a notification after the launch and must leave the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Logistics",
      "Finance"
    ]
  },
  "117276.0": {
    "summary": "The client was informed of the scheduled date of their boat's launch, which may be adjusted based on machine difficulties or temperature. They were also reminded to ensure their account balance is zero to secure their spot on the launch list.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "117283.0": {
    "summary": "Client (Mathias Marine Sports) inquired about the status of an inspection for their boat (Ebbtide) and the finalization of a potential FourWinns purchase. The agent provided updates on the inspection and promised to keep the client informed.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "117311.0": {
    "summary": "The client, Jake Rice, was informed about the planned watercraft launch date for their MAXUM 2700SE 2008, scheduled for May 23rd, 2023. The agent, Mathias Marine Sports, emphasized the importance of having a zero balance to avoid any delays and outlined the notification process. The client is required to leave the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "117344.0": {
    "summary": "The client was informed about the scheduled date for the boat's water intake, with the date being 2023-05-24. The client was also reminded to ensure their account balance is zero to avoid any issues with the water intake process. The agent provided instructions on what to expect after the water intake, including a first and second notification before the client can take possession of the boat and depart the marina.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Logistics",
      "Support"
    ]
  },
  "117366.0": {
    "summary": "The client was informed about the planned availability of their boat, with a predicted date of 2023-05-11. They were advised to ensure their account balance is zero to secure the planned week of use, and warned that the date might vary due to technical or environmental difficulties. The agent also notified the client about the process of notification and the expected departure time.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "117403.0": {
    "summary": "The client, De Mathias Marine Sports (Alexandre Laramee), was inquiring about a boat for summer but ultimately declined interest.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "117405.0": {
    "summary": "The client was informed about the planned launch date for their boat, FORMULA FORMULA 400SS 2004, which is scheduled for 2023-05-26. The client was also reminded to ensure their account balance is zero to proceed with the launch, and to follow the notification process to take possession of the boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "117412.0": {
    "summary": "The client was informed about the scheduled 'mise à l'eau' (launching of a boat) date, which was planned according to their reserved week in autumn. The client was warned that the date may change by a working day due to potential difficulties (machine, temperature, etc.). The client was also reminded to ensure their account balance is zero to secure their week's launch and to follow the notification process for taking possession of their boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "117417.0": {
    "summary": "The client received a notification about the upcoming launch date of their FOURWINNS VISTA 288 on 2023-05-15. They were informed about the possible variations in the date due to technical difficulties and were asked to ensure their account balance is zero to confirm the launch. They were also notified about the notification process and the deadline to leave the marina.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "117421.0": {
    "summary": "The client, Patrick Maisonneuve, received a notification from Mathias Marine Sports about the planned availability of his Larson Cabrio 265 2013 boat. The date scheduled for delivery is May 29, 2023, and the client must ensure that his balance is zero to avoid any issues. The client is advised to be available for pickup on the Saturday following the second notification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "117423.0": {
    "summary": "Client Maxime W Longtin is considering closing an account with Mathias Marine Sports, asking if the company still wants to work with them or if they can close the card.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "not present"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "117428.0": {
    "summary": "The client received a notification regarding the planned date of their boat's water intake, which was scheduled for 2023-05-15. They were informed to ensure their account balance is zero before the water intake, and to wait for notifications to take possession of the boat. The client was also reminded to depart the marina by the following Saturday.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "117431.0": {
    "summary": "The client received a scheduled delivery date for their bateau, TAHOE TAHOE 215 2007, which is planned for 2023-05-10. The agent informed the client to ensure their balance is zero to secure the delivery and warned that the date might be adjusted due to technical difficulties. The client was also notified about the notification process and the need to depart by Saturday after the last notification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "117439.0": {
    "summary": "The client, De Mathias Marine Sports, communicated with the agent, Kim Bessette, regarding the preparation and availability of a boat. The client provided photos of a problem with the boat's piers and requested prices for a moustiquaire and taquet. The agent responded with an estimated delivery date and instructions for the client to ensure their solde is at zero. The client received multiple notifications from the agent regarding the preparation and availability of the boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "117441.0": {
    "summary": "Client received a notification about a new boat in stock and thanked the agent for the information.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "117451.0": {
    "summary": "The client received a notification from Mathias Marine Sports with details about the scheduled launch date for their BAYLINER 300 BAYLINER 2009. The client must ensure their account balance is zero before the launch date to avoid delays. They will receive notifications once the launch is completed and after a technician has performed the usage checks. The client must collect their boat and leave the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "117460.0": {
    "summary": "Client De Mathias Marine Sports discussed their SEA RAY Venture 370 2013's planned launch date with agent Sylvain Paiement. Client had requested an earlier date but agent informed them that May 16th is the earliest available date. Client initially refused but eventually accepted the date.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "117461.0": {
    "summary": "The conversation is about a scheduled boat launch for a SILVERTON 390 MY FLYBRIDGE CUMMINS 355 2003, with a planned date of 2023-05-04. The client is informed about the importance of having a zero balance to ensure the launch is respected and the process of receiving notifications after the launch. The client also corrects the recipient's name and provides their contact information.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "117478.0": {
    "summary": "The client, Benoit Couture, was informed about the scheduled water baptism date for his boat, CHAPARRAL 290 SIGNATURE 2004. The date is set for 2023-05-25, but may vary by one working day due to machine or temperature issues. The client was also reminded to ensure their account balance is zero to avoid any issues with the water baptism process. The agent provided detailed instructions on the notification process and the expected timeline for the client to take possession of the boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "117511.0": {
    "summary": "The client received a notification from Mathias Marine Sports regarding the expected availability of their boat, FOUR WINNS FOUR WINNS 210 HORIZON 2013, scheduled for May 26, 2023. The client must ensure their account balance is zero and be prepared to collect the boat by the following Saturday. The agent warned that the date may vary depending on machine difficulties or temperature.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "117590.0": {
    "summary": "Conversation about boat repairs and planned water entry. Client had some components removed and reinstalled without connection. Received notice of planned water entry date and instructions for pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "slightly positive",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "117592.0": {
    "summary": "The client, Francis Lachaine, received an email from Mathias Marine Sports with the planned date for the water test of his SEA RAY 400 SUNDANCER 2008, scheduled for 2023-05-24. The date may be adjusted due to technical difficulties. The client needs to ensure their account is settled to 0 to secure the water test slot. After the water test, they will receive two notifications: the first for confirmation and the second for taking possession of the boat. The client must vacate the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "117599.0": {
    "summary": "The client was informed about the planned water testing date for their boat, BAVARIA BAVARIA S33 HT D3 220 EVC 2019, which will be scheduled based on their reserved autumn week. The client was also advised to ensure their account balance is zero to avoid any delays in the process. The agent explained the notification process, including the first notification after the water testing and the second notification after the technician's verification, and instructed the client to take possession of the boat and leave the marina by the following Saturday.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "117607.0": {
    "summary": "The client received a notification regarding the availability of their boat, the PRINCECRAFT QUORUM 25 2020, which is scheduled for May 4, 2023. The client is advised to ensure their account is paid in full to secure the rental period, and that any delays may impact the availability date.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "informative",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "117622.0": {
    "summary": "The client was informed about the scheduled availability of their TIGE WAKE RZ2 boat, with a planned date of 2023-05-05. The client needs to ensure their account balance is zero to guarantee the scheduled week of water usage. The agent warned that the date might vary due to technical difficulties and provided a plan for notifications and the expected departure time.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "117631.0": {
    "summary": "The client is being informed about the scheduled launch date of their boat, DORAL INTRIGUE 2005, which is planned for May 23rd. The agent explains the importance of having a zero balance to ensure the launch date is respected and the procedures that will be followed after the launch.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "friendly"
    },
    "concerned_departments": [
      "Logistics",
      "Finance"
    ]
  },
  "117632.0": {
    "summary": "The client, Hani Sinno, received an update on the scheduled 'mise à l'eau' (launching) date for his SEA RAY sea ray 390 1989, which is planned for 2023-05-22. The client was also informed about the importance of having a zero balance to ensure the smooth process of launching his boat. The client expresses gratitude and asks about the possibility of removing the Sea Ray logo from the boat's upholstery, but ultimately decides to defer this request until later.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Sales",
      "Logistics"
    ]
  },
  "117634.0": {
    "summary": "The client received a notification about the planned launch date of their boat. The date is set for 2023-05-03, but may vary by one workday due to potential difficulties. The client is required to ensure their account balance is zero for the launch to be processed. Notifications will be sent before and after the launch, and the client must vacate the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics",
      "Finance"
    ]
  },
  "117696.0": {
    "summary": "The conversation is about the upcoming availability of a boat. The client receives a notification about the planned availability date, which is May 3rd, 2023. The agent warns the client to ensure their account balance is zero to avoid any issues. The client receives multiple notifications about the preparation of the boat and the need to wait for further instructions.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "friendly"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "117698.0": {
    "summary": "The client was informed about the planned launch date of their BAYLINER BAYLINER 265 2006, which is 2023-05-24. They were also reminded to ensure their account balance is zero to avoid any issues with the launch. The client was instructed to wait for two notifications, one after the launch and another after the technician's verification, before taking possession of the boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "117703.0": {
    "summary": "The client was notified about the scheduled availability of their boat, with a planned date of 2023-05-19. The client was reminded to ensure their account balance is zero to secure their spot and warned that the date may be subject to change due to technical difficulties. The communication also mentioned notifications that will be sent to confirm the preparation and readiness of the boat for pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "117768.0": {
    "summary": "The client, Gabriel Gagnon, contacted Mathias Marine to inquire about the availability of his bateau. Initially, the planned date for the bateau's availability was set for May 19, 2023. However, the client requested to change the date to May 27, 2023, which was the original request.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite and inquiring",
      "agent": "informative and cooperative"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "117817.0": {
    "summary": "Client confirmed attendance at an event in Montreal, mentioning specific days and arrival time.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "117831.0": {
    "summary": "The client, Pierre Bourque, received a notification from Mathias Marine Sports about the scheduled launch date of his boat, PRINCECRAFT PRINCECRAFT PONTON 1995, which is planned for 2023-05-31. The client is reminded to ensure his account balance is zero to secure the launch date and to follow the instructions for receiving notifications and taking possession of the boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "117877.0": {
    "summary": "Client inquired about prices for different boat models, specifically the Rubicon Camo, including prices with and without a winch installed. Client also asked about the status of their order and requested a callback.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "117881.0": {
    "summary": "Client inquired about the price of the KTM SX50 factory edition and other similar models (Gas Gas MC 50 and Husqvarna TC 50). The agent informed the client that they are out of stock for the KTM SX50 but provided prices for the other models.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "117912.0": {
    "summary": "The client was informed about the scheduled launch date of their BAYLINER 215 2014, which is 2023-05-24, with a possibility of variation due to technical difficulties. The client was also reminded to settle their account before the launch and to collect their boat by the following Saturday. The agent thanked the client for their collaboration and wished them a good season.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics",
      "Finance"
    ]
  },
  "117921.0": {
    "summary": "Client inquired about the status of a boat purchase, inquiring if the agent still has a boat for sale to replace their current Sea Ray.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "117935.0": {
    "summary": "The client received an update on the availability date of their boat, a SUNSATION 32SS, scheduled for 2023-05-26. The agent reminded the client to ensure their account balance is zero to secure the boat's availability and to be prepared for potential delays due to machinery or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "117939.0": {
    "summary": "The client was informed about the planned availability of their boat, with a scheduled date of 2023-06-01. The agent reminded the client to have a zero balance to ensure timely pickup. The client was also warned about potential delays due to machinery or temperature issues.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "117940.0": {
    "summary": "Client inquired about the availability of a Kawasaki Ninja 650 2020 at Mathias Marine Sports. The agent, Alexandre Goulet, confirmed the bike's availability with some conditions.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "117998.0": {
    "summary": "The client was provided with a scheduled date for the availability of their boat, Boston Whaler 23 Outrage 2022, which is set for May 5, 2023. The client was also informed of the importance of having a zero balance to ensure a smooth pickup process. The agent explained that the date may be subject to change due to certain difficulties and provided a step-by-step notification process.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "118001.0": {
    "summary": "The client, Kuan Liang Xion, is informed about the planned water test date for their FOUR WINNS FW 375 2010, scheduled for 2023-06-06. The client is advised to ensure their account balance is zero to avoid any issues with the water test. They will receive notifications after the water test and must collect their boat by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "118041.0": {
    "summary": "The client, Robert Gagnon, received a notification about the scheduled launch date of his Monterey 330, which is 2023-05-04. The launch date may be adjusted due to machine or temperature issues. The client must ensure a zero balance to secure the launch and will receive notifications once the boat is launched and after a technician's inspection.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "118140.0": {
    "summary": "Client is waiting to hear news about a potential exhaust kit from a company named sns. They seem hopeful and expect to receive more information soon.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "hopeful",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "118148.0": {
    "summary": "The client received a follow-up message regarding the planned date of their boat (BOMBARDIER seadoo 2019) being placed in the water (2023-05-12) with possible date variations due to machine or temperature difficulties. The client is also reminded to ensure their account balance is zero to confirm the date and to follow specific instructions for notifications and pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "118208.0": {
    "summary": "The agent, M. Ment, informed the client, De Mathias Marine Sports, that their propellers are ready for pickup at the agent's office. In a separate message, the agent provided the client with the scheduled launch date for their Chaparral Signature 290, 2005, which is set for May 31st, and outlined the necessary steps for pickup, including clearing their balance and receiving a notification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "118209.0": {
    "summary": "The agent confirmed the planned water intake date for the client's BENETEAU ANTERAZ 27 2021, scheduled for 2023-05-19. The client was informed to ensure their account balance is zero before the intake and to follow the process for taking possession of the boat. The agent reminded the client to leave the marina by the following Saturday.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "118221.0": {
    "summary": "The conversation is about a planned boat launch on May 19, 2023, with possible delays due to machine or temperature issues. The client needs to ensure their account is settled before the launch and must depart the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "118229.0": {
    "summary": "The client has received an update on the availability of their boat (BAYLINER 245sb 2005), with a scheduled availability date of 2023-05-01. They are reminded to ensure their account balance is zero to secure their reservation, and to be available for pickup no later than the Saturday following the final notification.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "118231.0": {
    "summary": "The client (De Mathias Marine Sports) received a notification from the agent (Stephanie Chicoine) regarding the availability of their boat (STINGRAY 240 cs 2004). The boat is expected to be available on 2023-05-18 and the client must ensure their account balance is zero to avoid any issues. The agent warned that the date might be subject to change due to unforeseen difficulties.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "118306.0": {
    "summary": "The client, De Mathias Marine Sports, has been informed about the planned availability of their Mastercraft xt21 2020 boat on 2023-05-17. The client must ensure their account balance is zero before pickup and is responsible for leaving the premises by the following Saturday. The agent has provided clear instructions and notifications regarding the boat's preparation and handover process.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "118310.0": {
    "summary": "The client received a notification from Mathias Marine Sports about the planned availability of their boat, scheduled for May 10, 2023. The client is informed to ensure their account is paid in full before the boat can be transferred to the departure list. The agent warns that the date might be adjusted due to mechanical or temperature issues, and notifications will be sent for the process commencement and completion.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "118313.0": {
    "summary": "The client has been informed about the scheduled availability of their Master Craft XSTAR 2016 boat, with a planned availability date of 2023-05-09. The client needs to ensure their balance is zero and be aware that the date might change due to technical difficulties. The client must also vacate the premises by Saturday after the final notification.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Neutral",
      "agent": "Polite and informative"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "118318.0": {
    "summary": "The client was informed about the planned availability date of their boat (CHAPARRAL SURF 24 2020) on 2023-05-12, and was reminded to ensure their account balance is zero to secure the boat for pickup. The agent also mentioned that the date might be adjusted due to technical difficulties.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "118334.0": {
    "summary": "Client De Mathias Marine Sports discussed with BNC analysts about revising the dossier with a co-signatory. Provided identification and contact information for their spouse who will be calling the agent. Discussed business location and thanked the agent.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "118389.0": {
    "summary": "The client was informed about the planned date for the boat launch, with a possible variation of one working day due to potential difficulties. The client must ensure a zero balance to secure the launch and will receive notifications after the launch and when a technician has checked the boat. The client must vacate the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "118428.0": {
    "summary": "Client Antoine from Mathias Marine Sports inquired about two exhaust options for his Bobber motorcycle. Agent Maxime provided a price quote for the Dr Jekill & Mr Hide exhaust, but it was deemed too expensive by the client. The client asked if there was any wiggle room on the price, but the agent replied that he could only offer a $100 discount.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "disappointed, frustrated",
      "agent": "helpful, but limited in offering price concessions"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "118434.0": {
    "summary": "The client (Mathias Marine Sports) was informed about the scheduled launch date of their LEGEND all star15 2013 boat, which is planned for May 9th, 2023. The agent (Martin Bureau) clarified that the date might be adjusted based on technical difficulties or weather conditions. The client was also reminded to ensure their account balance is zero before the launch and to follow up with notifications from the agent.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales",
      "Logistics"
    ]
  },
  "118456.0": {
    "summary": "Client received a notification from Mathias Marine Sports about the planned availability of their boat, FOUR WINNS FOUR WINNS 235LX 2014, which is scheduled for 2023-05-08. The client was reminded to ensure their account balance is zero and to be aware that the date may vary depending on encountered difficulties. The agent provided a step-by-step process for pickup and reminded the client to vacate the premises by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "118463.0": {
    "summary": "The client was informed about the scheduled availability date of their boat, PRINCECRAFT VENTRA 2022, which is set for 2023-05-23. The client needs to ensure their account balance is zero to transfer the boat to the departure list. The client will receive two notifications before collecting the boat. The client must leave the premises by the Saturday following the second notification.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Finance"
    ]
  },
  "118477.0": {
    "summary": "The agent, Line Gervais, communicated the planned launch date for the client's STARCRAFT NEW NEXT STAR 23 2003, set for 2023-06-01. The agent warned that the date may vary due to machine or temperature difficulties. The agent also outlined the process for the client's launch, including notifications and the need to clear their balance to ensure timely launch.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "118520.0": {
    "summary": "Client confirmed their attendance at the Montréal Boat Show in the Manitou Pontoon Kiosk from February 9th to 12th.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "118536.0": {
    "summary": "Client De Mathias Marine Sports (Alexandre Laramee) inquired about availability at their marina for the summer. The client had a prior engagement with a buyer, but was able to return and discuss the issue with the agent.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales",
      "Logistics"
    ]
  },
  "118543.0": {
    "summary": "Client submitted a price drop lead for a 2007 Sea Ray SUNDANCER 330 at Mathias Marine, with a price of $159,800.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "118578.0": {
    "summary": "Client Eric discussed boat maintenance with Marie-Andree, requesting an estimate for replacing anodes, fixing a leak, replacing spark plugs, oil service, and trailer repair. Marie-Andree provided estimates for anode replacement and trailer repair, but postponed leak diagnosis until spring.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "118599.0": {
    "summary": "The client and agent discussed the planned water intake date for the client's REGAL commodore 2460 1990, which is scheduled for 2023-05-23. The client is required to have a zero balance to ensure the water intake date is respected. The agent will send two notifications: one upon water intake and another after a technician's verification. The client must vacate the marina by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Logistics"
    ]
  },
  "118643.0": {
    "summary": "The client was provided with a scheduled date for the availability of their boat. The date was set based on their reserved week in autumn. The client was informed to ensure their balance is zero to guarantee the week's availability. They were also warned that the date might vary by a business day due to potential issues. The client is required to leave the premises by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "118652.0": {
    "summary": "Client was informed about the scheduled availability of their boat and the necessary steps to follow. They clarified that the boat is on a trailer and requested confirmation that their account balance is zero and that their boat keys are ready for pickup.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "cautious",
      "agent": "professional"
    },
    "concerned_departments": [
      "Logistics",
      "Support"
    ]
  },
  "118682.0": {
    "summary": "The client, De Mathias Marine Sports, has been informed of the planned availability date for their 2021 FORD MUSTANG GT CONVERTIBLE. The date is set for 2023-04-28, and the client must ensure their account balance is zero before the bateau can be transferred. The client will receive two notifications, one when the process of taking the bateau out of storage begins and another when the bateau is ready for pickup. The client must leave the premises by the following Saturday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "118772.0": {
    "summary": "The client, De Mathias Marine Sports, is maintaining an exceptional discount rate of 8.99%.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "118833.0": {
    "summary": "Client inquired if the company is still looking for a motoneige, moto, VTT, côte à côte or vélo de montagne, indicating potential interest in purchasing a product.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "118844.0": {
    "summary": "Client inquired about texting availability, then confirmed purchase at Granby and asked for a phone call.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "118897.0": {
    "summary": "Client inquired about boat trailer recordings and remittance of $500. Provided credit card information and received assistance from the support team.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "118902.0": {
    "summary": "The client, Martin, contacted Mathias Marine Sports to inquire about trading in his 'Chieftain' for a 'Bobber'. The agent, Nicolas Guignard, provided a price of $24,144 for the trade.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "118999.0": {
    "summary": "Client contacted Mathias Marine for boat selling services, discussing their benefits, pricing, and storage options. Client inquired about storage price discounts.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "119015.0": {
    "summary": "The client, De Mathias Marine Sports (Alexandre Goulet), inquires about the status of a project in India, asking if it has been put on hold.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "119142.0": {
    "summary": "The client, Mathias, rescheduled a meeting with agent Alex to Wednesday morning, discussing availability on Tuesday afternoon.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "119180.0": {
    "summary": "Client Nicolas Guignard inquired about a AfricaTwin with 6.9% financing, but also considered a Transalp due to initial misinformation about the financing rate. After clarifying the financing process, the client secured financing for the AfricaTwin and plans to purchase it. The conversation was marred by initial miscommunication and the client's frustration with the initially quoted financing rate.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "frustrated",
      "agent": "apologetic"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "119293.0": {
    "summary": "Client initiated a follow-up on the boats sent via text message to inquire if any of them are of interest.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "119319.0": {
    "summary": "The client initiated the conversation in French, inquiring if the agent arrived at work on a bicycle, finding it amusing that it was cold outside.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "amused",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "119486.0": {
    "summary": "Client Maxime W Longtin from De Mathias Marine Sports inquired about the availability of specific products (motoneige, moto, VTT, côte à côte, vélo de montagne) and expressed gratitude.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "not present"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "119488.0": {
    "summary": "Client, Maxime W Longtin from De Mathias Marine Sports, inquired about available product categories (motoneige, moto, VTT, côte à côte, or vélo de montagne) for potential purchase.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Positive",
      "agent": "Not applicable (new conversation)"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "119548.0": {
    "summary": "Client cancelled their purchase due to financial concerns, apologized for the inconvenience and thanked the agent for their service.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "119565.0": {
    "summary": "Client is requesting a call back from the agent, Maxime from De Mathias Marine Sports left a phone number and a polite greeting.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "119581.0": {
    "summary": "Client Maxime Labbé of De Mathias Marine Sports contacted the agent Jimmy to cancel a machine, but initially expressed confusion about being told to wait. The client eventually decided to cancel, but seemed frustrated with the initial response.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "119612.0": {
    "summary": "The conversation was about the client's interest in purchasing a rzr Harry. The client requested a 5-day wait and asked about the availability of the rzr. The agent responded with a question about the client's interest and offered a specific model (1000 s rzr).",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "119692.0": {
    "summary": "The client, Guy, and agent, Alexandre Laramee, discussed a missing document required for a transfer. The client requested a copy of the vessel permit and a photo of the transferor's driver's license. The agent initially requested a large amount of money to be transferred to a person the client had never met, but later clarified that the payment was only for a transfer to Pierre Dion. The client was satisfied with the clarification and the agent provided contact information for further assistance.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "119753.0": {
    "summary": "The client, Alexandre Laramee from De Mathias Marine Sports, inquiries about scheduling a meeting to discuss the Carver Mariner 36 with his wife. The agent, Mr. Fecteau, informs the client that the product is not currently in stock but will hold their contact information in case one becomes available by the end of October.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "119756.0": {
    "summary": "The client, Mathias Marine Sports, had a conversation with Alexandre Laramee to gather information for an insurance submission. They discussed the model and year of the engine, the presence of a antitheft bar, the boat's markings, the engine's power, and the boat's speed. The client had some concerns about the distinction between the engine model and the propeller model, and also inquired about the status of follow-up calls with insurance companies. The conversation was resolved with the client's questions answered and a follow-up on the antitheft bar and boat markings.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "mostly satisfied, with some moments of frustration",
      "agent": "professional and helpful"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "119769.0": {
    "summary": "Client Maxime W Longtin inquires about available products from Mathias Sports, specifically snowmobiles, motorcycles, mountain bikes, and other outdoor equipment.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "119780.0": {
    "summary": "Client Patrick Audette from Mathias Sport received two Honda Gold Wings and is inquiring about the status of a potential purchase.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "119790.0": {
    "summary": "Client inquires about the status of interest in Tige and shares a link related to boat coverage in Canada.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "119792.0": {
    "summary": "Client Maxime W Longtin from De Mathias Marine Sports inquired about the availability of a snowmobile, motorcycle, mountain bike, tandem bike, or mountain bike, and expressed gratitude.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "119809.0": {
    "summary": "The client inquired about the availability of a Cruisers Yachts 375 Motor Yachts 2005, and the reason for the previous buyer's cancellation, with the agent providing an update on the issue and inviting the client to view the boat in store.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "119812.0": {
    "summary": "Client, Alexandre Laramee from De Mathias Marine Sports, reached out to Justin to follow up on a previous meeting about boats. He inquired if Justin is still in the market for a boat.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Positive",
      "agent": "Neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "119821.0": {
    "summary": "Client is following up to inquire if the agent, Nick Dinardo, is still looking for a surf boat and expresses gratitude for the agent's service.",
    "sentiment_overall": "Positive",
    "sentiment_details": {
      "client": "Positive",
      "agent": "Positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "119824.0": {
    "summary": "Client inquired about a photo taken by Holly, vehicle transaction taxes, and ATAC documentation for SAAQ. Agent provided clarification on transaction taxes and ATAC requirements, apologizing for a difficult day.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "119885.0": {
    "summary": "Client provided a detailed quote for the installation of a motor, including various components and labor costs, and provided contact information for parts ordering.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "not present"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "119905.0": {
    "summary": "The client, Maxime W Longtin from De Mathias Marine Sports, inquired about the availability of various products (snowmobile, motorcycle, mountain bike, tandem bike, or mountain bike) and thanked the agent.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "119912.0": {
    "summary": "Client De Mathias Marine Sports cancelled an order due to a change of heart by their director, and a perceived unfair pricing arrangement. The agent is trying to schedule a meeting to discuss a new deal.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "frustrated",
      "agent": "persistent"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "119924.0": {
    "summary": "The client, Jean-François, is purchasing a vehicle from Mathias Marine Sports. He initially expresses frustration with the tunnel and his work schedule, but is later able to confirm his appointment for Friday. He apologizes for the inconvenience and provides clarification on his payment method.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "mixed (positive and negative emotions, but overall neutral)",
      "agent": "professional and helpful"
    },
    "concerned_departments": [
      "Sales",
      "Logistics"
    ]
  },
  "119931.0": {
    "summary": "Client Tom Ropeleski is purchasing a 2017 KTM EXC-F 250 from Mathias Marine Sports. The conversation involves discussion of bike details, services, and parts. Client has multiple questions regarding the bike's history, current condition, and specifications. Agent Maxime Labbé is assisting in providing information and clarifications.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive (client is enthusiastic and eager to purchase the bike, but also cautious and wants to ensure he gets the correct information)",
      "agent": "neutral (agent is professional and helpful, but also seems to be following up on previous emails and trying to clarify some points)"
    },
    "concerned_departments": [
      "Sales",
      "Support"
    ]
  },
  "119950.0": {
    "summary": "Client scheduled an event (portes ouvertes) in the store on March 10-11, thanked the agent and looked forward to seeing them.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "119953.0": {
    "summary": "The client initiated the conversation with a greeting in French, inquiring about the agent's continued interest in a boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "curious",
      "agent": "available"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "119966.0": {
    "summary": "The client is sending a payment guarantee to the store and will be presenting the bank draft in person tomorrow. The client will be unavailable due to a scheduled day off and a boat show, but their colleague Olivier Lebeau from the finance department will be in contact with the agent to finalize the payment.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "polite and appreciative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Finance"
    ]
  },
  "119968.0": {
    "summary": "Client inquires about the status of a purchase agreement and requests to sign and return it.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "119969.0": {
    "summary": "The client inquired about the agent's availability for Friday.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "119978.0": {
    "summary": "The client confirmed their appointment for vehicle service and provided payment instructions, thanking the agent for the purchase.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Finance"
    ]
  },
  "119982.0": {
    "summary": "Client De Mathias Marine Sports inquired about a possible price increase from 4000$ to 4250$ including taxes, and then thanked the agent for their time.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "119991.0": {
    "summary": "Client De Mathias Marine Sports discussed a purchase with agent Janie regarding a product priced at $5,200 + tax. They agreed on payment terms, including a payment of $5,000 via credit card and the remaining $978.70 via bank transfer. The transaction was confirmed and the client left a positive note.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120005.0": {
    "summary": "Client cancelled their interest in a dock due to an urgent visit to the hospital, with a polite and friendly conversation.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "negative",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120007.0": {
    "summary": "Client inquires about the status of a boat purchase, and the agent informs them that they have listed their boat for sale and will reassess the situation at the end of the winter. The client expresses no urgency and thanks the agent for their availability.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120011.0": {
    "summary": "The client, who speaks French, inquires about the current status of a boat and expresses interest in having the agent visit the SeaRay. The tone is polite and friendly.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120020.0": {
    "summary": "The client, De Mathias Marine Sports, checked in with the agent to inquire about their interest in purchasing a boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120030.0": {
    "summary": "Client and agent discussed availability of a boat viewing, planned for this Friday. Agent confirmed the boat's availability and suggested different time slots, with the client agreeing to meet in the afternoon.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120035.0": {
    "summary": "The client, Alexandre Goulet from Mathias Marine Sports, had an uneventful week and asked the agent to discuss further the next day.",
    "sentiment_overall": "Negative",
    "sentiment_details": {
      "client": "Negative",
      "agent": "Positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120039.0": {
    "summary": "Client enquired about the availability of Outlaw 110 2022, and was informed that the 2023 model is still available.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Positive (polite and inquiring)",
      "agent": "Neutral (informative)"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120065.0": {
    "summary": "Client de Mathias Marine Sports is following up on a boat purchase, inquiring about the status of their order. The client is still searching for a boat, and the agent informs them that the Doral is still available.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120081.0": {
    "summary": "Client Nicolas from Mathias Sports inquired about receiving emails, mentioned being on vacation and provided a contact number for his colleague Christian. Agent Nicolas Guignard introduced himself as a sales representative from Mathias Marine Sports, initially responding to the client's initial email.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "friendly"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120131.0": {
    "summary": "Client Mathias Marine Sports (Alexandre Goulet) and Jacques Tremblay discussed various topics, including a vehicle purchase, delivery, and potential compensation for a rental machine. The client confirmed a meeting and provided proof of rental, and the agent reassured him about the compensation. They also discussed a windshield discount and installation.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120155.0": {
    "summary": "The client, Alexandre Goulet from De Mathias Marine Sports, contacted the agent to inquire about a potential price drop on a Polaris Slingshot SL 2022. The client provided details from an AutoHebdo.net ad, including the price, financing term, and other relevant information.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales",
      "Finance"
    ]
  },
  "120165.0": {
    "summary": "Client, De Mathias Marine Sports (Alexandre Goulet), expresses gratitude for the company's excellent service, fast and complication-free transaction, and beautiful product. They appreciate the agent's patience and offer to leave a Google review if desired.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "extremely positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "120170.0": {
    "summary": "The client, Alexandre Goulet, was inquiring about a motorcycle purchase from De Mathias Marine Sports. The client expressed frustration with the slow delivery process, but appreciated the agent's welcome and advice. The agent apologized for the delay and offered to follow up with the client in the summer.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "negative",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "120195.0": {
    "summary": "Client inquired about the progress of their boat purchase process.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite",
      "agent": "not specified"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120197.0": {
    "summary": "The client, Jean-Philippe Landry, initially asks about the status of his purchase for a CF MOTO CFORCE 500 1UP EPS LX 2022. The agent, Alexandre Goulet, responds with a message about a changed pickup time for the vehicle and provides a link to confirm the client's presence. The client responds with a message asking to confirm the pickup time again, and the agent sends the same message twice with a slight variation.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120199.0": {
    "summary": "The client, Blair, followed up with Alexandre to inquire about the status of their boat search. Alexandre responded, inquiring if the client was still looking for a boat and expressing his pleasure to serve. The client confirmed their interest and informed Alexandre they had been busy and couldn't dedicate much time to the search.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120203.0": {
    "summary": "The client, Alexandre Goulet, is experiencing issues with their bicycle (vtt). The brakes are releasing prematurely and the handlebar heater is not working.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120205.0": {
    "summary": "The client, Mathias Marine Sports, discussed with Alexandre Goulet about a received windshield and a contract for a new VTT. The client requested that the contract be corrected to specify that the VTT is new, and Alexandre assured him that it would be done. The client expressed his excitement to see photos and reminded Alexandre to include the specification on the contract.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "120209.0": {
    "summary": "Client De Mathias Marine Sports inquired about the status of a project, informed the agent they had abandoned it, and received a response from the agent.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "negative",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120215.0": {
    "summary": "Client inquires about the status of tire installation on their bike, suggesting they could do it themselves if it hasn't been done yet.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120226.0": {
    "summary": "Client confirmed receipt of deposit and showed approval with 👍, indicating a positive transaction.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120238.0": {
    "summary": "Client inquired about the agent's future visits to the Montreal area and surrounding regions. Client mentioned they haven't planned anything yet but will keep the agent updated.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "polite"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120240.0": {
    "summary": "Client inquired about the status of a boat purchase and confirmed their interest in the coastal edition.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Positive",
      "agent": "Positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120251.0": {
    "summary": "Client and agent discuss the availability of an 'annexe' and arrangements for a meeting. The client confirms they have it in stock and awaits the agent's news. The conversation is professional and polite.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120252.0": {
    "summary": "The client, De Mathias Marine Sports, inquired about the availability of Cobalt and SeaRay boats, inquiring if they have visited the models.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales",
      "Logistics"
    ]
  },
  "120256.0": {
    "summary": "Client, Alexandre Goulet, from De Mathias Marine Sports, discussed options with Michel but is still in reflection and planning to decide in February. The agent provided a follow-up appointment suggestion and wished him good luck with his decision.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120261.0": {
    "summary": "Client Maxime W Longtin from De Mathias Marine Sports inquired about available products (motoneige, moto, VTT, côte à côte, vélo de montagne) but eventually declined assistance as they found what they were looking for.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120266.0": {
    "summary": "Client is unhappy with the service they received from Alex, stating that no one is responding to their messages and that NC doesn't want their machine. They mention a humorous exchange with Alex, but overall seem frustrated with the situation.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120267.0": {
    "summary": "Mustafa is negotiating the price of Francis' boat, which is listed at 255k. He has found a newer and bigger boat for 260k and is trying to get Francis to lower his price. Mustafa has calculated a price of 230k for Francis' boat, which he thinks is a fair price considering the difference in age and model. He has asked Alexandre to discuss the price with Francis and is willing to put a deposit if Francis agrees to the price.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "frustrated and assertive",
      "agent": "uncooperative and dismissive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120271.0": {
    "summary": "Client expressed interest in purchasing a new snowmobile, despite the return of cold weather, and appreciates the agent's assistance.",
    "sentiment_overall": "Positive",
    "sentiment_details": {
      "client": "Positive (friendly, appreciative)",
      "agent": "Positive (helpful)"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120293.0": {
    "summary": "The client (De Mathias Marine Sports) is following up on the boat purchasing process and expressing gratitude.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120299.0": {
    "summary": "Client informs agent about a new bike opportunity, specifically a RED GoldWing Tour DCT Airbag, and inquires if it might interest the agent.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120307.0": {
    "summary": "Client Mathias Marine Sports had follow-up conversations with two different agents regarding the status of a dossier and payment. The client was initially updated on the virement process, but later expressed concern about not receiving a follow-up on their return of accessories and a missing $500 deposit. The client was assured that the missing deposit would be processed and the accessories would be sent shortly.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "negative",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Finance"
    ]
  },
  "120311.0": {
    "summary": "Client Nicolas Guignard from Mathias Marine Sports inquires about the availability of a motoneige or timbersled, inquiring if they are still being searched for.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "inquiry",
      "agent": "no information provided"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120313.0": {
    "summary": "Client De Mathias Marine Sports confirmed a rendez-vous for a vehicle General XP 4 1000 Premium on 2023-02-06 10:00, provided a link to confirm presence and reminded payment details.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120317.0": {
    "summary": "Client Max Longtin from Mathias Sports inquired about the availability of various vehicles (motoneige, moto, VTT, côte à côte or vélo de montagne) and expressed gratitude.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "unknown"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120329.0": {
    "summary": "Client David discussed a purchase agreement and upcoming transportation with agent Nicolas Guignard. David initially tried to contact Nicolas, but they eventually spoke and Nicolas reminded David that the warranty expires on December 29, 2023.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120332.0": {
    "summary": "Client confirmation of a rendez-vous for a CFORCE 500 1UP EPS LX vehicle on 2023-02-06 08:00. Client provided payment information and was reminded to bring necessary documents.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales",
      "Support"
    ]
  },
  "120333.0": {
    "summary": "Client De Mathias Marine Sports (Joly-Ann Hamel) confirms the decision to purchase and secures the loan with a 2-year warranty. Agent assists with insurance options and prepares the contract for the client.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120337.0": {
    "summary": "Client inquired about available boats in the inventory.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120338.0": {
    "summary": "The client, De Mathias Marine Sports, had a conversation with the agent Frédérick about a Glastron 195 GX 2023 boat sale. The client had initially inquired about another boat but eventually purchased a Kubota instead, jokingly saying he will use it to 'wait' for the boat.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120339.0": {
    "summary": "The client, De Mathias Marine Sports, asked if there was a co-signatory for a file.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "curious",
      "agent": "not specified"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120348.0": {
    "summary": "Client Maxime W Longtin inquired about available products (motoneige, moto, VTT, côte à côte, or vélo de montagne) from the company.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "not present in the conversation"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120365.0": {
    "summary": "Client inquired about the agent's (Steven) availability to come into the store on a Saturday.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Polite",
      "agent": "Not mentioned"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120381.0": {
    "summary": "Client, Alexandre Laramee, inquired about a trade-in price for a boat. The agent, Peter Zito, initially listed the price at $29,900 + tax. The client expressed frustration with the price, suggesting it was too high. The agent explained that the price was based on market value and that they needed to discuss the trade-in price with their manager. The client provided comparisons to other boats listed on the site, attempting to negotiate a better price.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "frustrated",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "120391.0": {
    "summary": "The client, Maxime Labbé, is extremely dissatisfied with the inspection and condition of the motoneige he received from Mathias Marine Sports. He listed several issues with the vehicle, including a lack of maintenance, worn-out parts, and missing components. The agent, Michael, apologized and assured the client that he would report the issue to the service department and try to resolve it as soon as possible.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "very negative",
      "agent": "apologetic"
    },
    "concerned_departments": [
      "Support",
      "Service"
    ]
  },
  "120414.0": {
    "summary": "The conversation between Romain and Nicolas from Mathias Marine Sports was mainly about scheduling a meeting, discussing a financial matter, and organizing the delivery of a product. There were some issues with an estimate and missing parts, but it was clarified and resolved. The client seemed generally satisfied with the communication and resolution.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Finance",
      "Logistics"
    ]
  },
  "120416.0": {
    "summary": "The client, De Mathias Marine Sports, is discussing the purchase of a 2007 Monterey 290 with an agent. They are negotiating the price and discussing logistics, including the presence of AC, a generator, and a bow thruster. The client is also seeking assistance with communication with the seller, who speaks only French.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "frustrated",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "120417.0": {
    "summary": "Client Laurent Meriaux asked about the expert's update on the boat, was informed that the boat is new and will receive an update later in the week. Client is satisfied with the update.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120428.0": {
    "summary": "Client Marie-Ève Bouvier-Moisan contacted Alexandre Goulet regarding the delivery status of an order (Polaris Switchback Assault 2019) placed with Mathias Marine Sports. Alexandre informed the client that the order was not received and suggested calling Michel at the store for further information.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120429.0": {
    "summary": "Client Mathias Marine Sports (Alexandre Laramee) discussed and confirmed a meeting to view a boat with the client, initially scheduled for Saturday at 11h, then rescheduled to Monday at 15h. The client also inquired about the price of the boat and asked if it was negotiable.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120433.0": {
    "summary": "Client Nicolas Guignard from De Mathias Marine Sports inquired about the availability of an e-bike, specifically Intense or Gasgas models, as a follow-up.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Curious",
      "agent": "Not specified, but likely attentive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120435.0": {
    "summary": "Client asked if the agent received promotions on VTT, apologized for the wasted time, and congratulated the agent on their response.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120436.0": {
    "summary": "Client sent the contract copy to the agent, Tommy, for review and confirmation of details. The client asked to schedule a call for 13:45 for the deposit process.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite and professional",
      "agent": "responsive and confirming"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120437.0": {
    "summary": "Client Nicolas inquires about the status of his KTM 390 Adventure follow-up and asks if Sylvain is still searching for it.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "not present"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120440.0": {
    "summary": "Client schedules an appointment for Friday, February 10th at 11am. Discusses the 11th being a Saturday and agent corrects the time to 10am.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120444.0": {
    "summary": "The client, Alexandre Laramee from De Mathias Marine Sports, discussed several topics with the agent. They confirmed a delivery or inspection with Richard Coupal and clarified some communication issues with SMS not being received in the correct system. They also scheduled a call at 16h and a meeting with Richard on Wednesday at 9h AM.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Sales",
      "Logistics"
    ]
  },
  "120450.0": {
    "summary": "Client De Mathias Marine Sports (Alexandre Laramee) made an initial inquiry about visiting the Chaparral boat in store, but due to COVID-19, they had to postpone the visit. The agent wished them a speedy recovery and awaited their return. The conversation continued with the client inquiring about the agent's capability to source boats from America, which the agent explained they no longer offer this service.",
    "sentiment_overall": "Neutral",
    "sentiment_details": {
      "client": "Positive (initial inquiry, friendly tone, and casual language)",
      "agent": "Positive (friendly tone, apology, and welcoming language)"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "120451.0": {
    "summary": "Client Dominic Sanfacon inquired about the status of a boat sale, and the agent Annie Pagé responded that she could contact him the following week.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120459.0": {
    "summary": "Client De Mathias Marine Sports inquired about a preference for a service, but the conversation was interrupted. The client expressed gratitude towards Marion, the financial director, for her kind message, but seemed to be addressing a previous issue.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral (mixed emotions: gratitude and frustration)",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Finance"
    ]
  },
  "120462.0": {
    "summary": "Client De Mathias Marine Sports discussed a balance of $884.95 with agent Michel, agreed to pay by credit card, and requested a photo of a pontoon's QC number.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "satisfied",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120465.0": {
    "summary": "Client Éric inquired about his interest in the baja product, citing lack of time but still being interested. He asked the agent to send him a sign-up form when they have a few minutes available.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120467.0": {
    "summary": "Client Nicolas is returning a contract for the FX450 and Timbersled RIOT, and inquiring about the price of the Timbersled, which is $6999 plus tax.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120471.0": {
    "summary": "Client De Mathias Marine Sports discussed financing (twice) and requested a photo of the agent's motorcycle records with agent Carl. The client also asked agent Carl to be available by phone.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "very polite and grateful",
      "agent": "not explicitly mentioned"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120482.0": {
    "summary": "Client Maxime Labbé from De Mathias Marine Sports inquired about the RZR 200's price (between $90 and $115 at 2-week intervals) with a loan term between 60 and 84 months and an average interest rate of 10.99%. The agent confirmed the pricing is available online, and the client needs to verify with their spouse and check the laws before making a decision.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive (apologetic, friendly, and casual)",
      "agent": "positive (friendly and helpful)"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120491.0": {
    "summary": "Client Michel Bouchard from Humijet Inc. inquired about the price of a Scarab sent by Alexandre Laramee from Mathias Marine Sports, expressing that it is too expensive for his means.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120501.0": {
    "summary": "Client Nicolas from De Mathias Marine Sports followed up with Eric about interest in a Gasgas bike, discussed availability, and arranged a call.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120502.0": {
    "summary": "The conversation revolves around a boat maintenance and sale discussion between Alexandre Laramee from Mathias Marine Sports and Martin Côté from Superior Propane. The client, Alexandre, inquires about the status of his boat's maintenance and the potential selling price. Martin Côté provides information about the maintenance work done by the Garage Malouin and estimates the selling price of the boat.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "helpful"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "120503.0": {
    "summary": "Client De Mathias Marine Sports reported an issue with a key not turning in the correct location. The agent attempted to resolve the issue by searching the service and checking with other keys. The problem was eventually resolved when a new key was found and inserted. The client was assured that their inspection and boat departure would proceed as scheduled.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Logistics"
    ]
  },
  "120507.0": {
    "summary": "The client inquires about the interest rate and terms of a boat purchase, and the agent provides information on the boat's condition, financing options, and suggests setting up an appointment to view the boat.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120515.0": {
    "summary": "Client Maxime W Longtin from De Mathias Marine Sports inquires about the company's need for a motoneige, moto, VTT, côte à côte or vélo de montagne. The client expresses gratitude.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive (friendly and polite)",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120516.0": {
    "summary": "The client, De Mathias Marine Sports, inquired about the company's interest in purchasing the KTM 450 SX-F Factory.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "missing"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120519.0": {
    "summary": "The client, De Mathias Marine Sports, is confirming a meeting for the CFORCE 500 1UP EPS LX vehicle on 2023-02-06 at 11:00. The agent is providing a link for the client to confirm their presence and reminding them of payment details.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120520.0": {
    "summary": "Client Maxime from Mathias Sports inquires about purchasing a Side by Side, and agent Lisa informs them that the unit is in stock and provides her contact information.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120524.0": {
    "summary": "Client Mathias Marine Sports made appointments for Maxime to visit the store on Monday afternoon. The client also inquired about a Larson Cabrio boat and mentioned a preference for it. Additionally, the client mentioned a transaction involving a boat and a possible price exchange.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive (expressed gratitude and made appointments)",
      "agent": "positive (responsive and helpful)"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120527.0": {
    "summary": "The client confirmed receiving photos of a gala and plans to meet with the agent to view them.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120528.0": {
    "summary": "Client is inquiring about a product and asking the agent if they've looked into it, offering to send a photo of a similar product being delivered the next day.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120533.0": {
    "summary": "The client, Marion Guisiano, contacted the agent, Mavrick, to discuss a loan application. The client sent documents, and the agent confirmed receipt. However, the loan was rejected due to a mismatch in the loan-to-value ratio, and the client was asked if their spouse could cosign. The client agreed to discuss it with their spouse and follow up later.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite and cooperative",
      "agent": "helpful and professional"
    },
    "concerned_departments": [
      "Support",
      "Finance"
    ]
  },
  "120541.0": {
    "summary": "Client, De Mathias Marine Sports, discussed the usefulness of a winch and confirmed an arrival time for Thursday, with agent Marion Guisiano confirming payment and scheduling a meeting.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive (initially joking, then friendly and casual)",
      "agent": "positive (friendly, welcoming, and professional)"
    },
    "concerned_departments": [
      "Finance"
    ]
  },
  "120542.0": {
    "summary": "Client De Mathias Marine Sports reported an issue with an assault product and requested a high-quality repair and a remark (RMK) for the issue. The agent Eric apologized and promised to address the issue the next day.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120545.0": {
    "summary": "Client, Alexandre Goulet from De Mathias Marine Sports, has confirmed that the Vitpilen 701 won't be available this year. He is considering the CLX700 from CFMoto as an alternative and will let the agent know if he finds a used Vitpilen 701.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "slightly negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120551.0": {
    "summary": "The client, De Mathias Marine Sports, is confirming a meeting for a vehicle purchase and discussing payment methods. The client initially missed the agent, Jonathan, and then had to recontact him. The agent's assistant, Alex, eventually got involved to clarify the situation and apologize for the miscommunication.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive (initially frustrated but polite and apologetic)",
      "agent": "neutral (initially unresponsive, then apologetic and helpful)"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "120553.0": {
    "summary": "The client inquired about the promotion on KTM XCF-W models, referencing Nicolas.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "curious",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "120559.0": {
    "summary": "Client De Mathias Marine Sports (Alexandre Laramee) initiated a conversation, but provided an invalid or nonsensical input 'testTest', indicating a potential issue or need for assistance.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "informed"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120560.0": {
    "summary": "The client inquired about a used Yamaha FZ10 bike, asking about aftermarket parts and the price. The agent provided a price, but the client found it too low due to the bike's excellent condition and higher mileage. The bike was eventually sold, and the client inquired about alternative choices.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120561.0": {
    "summary": "Client inquired about a product link and expressed interest in Ranger 570 premium, followed by a request for pricing and an offer from the agent.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120563.0": {
    "summary": "Client sent a link to their website and requested agent's feedback on their inventory. The client thanked the agent for their time and bid farewell, wishing them a good weekend.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "grateful",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120565.0": {
    "summary": "The client is trying to purchase a pontoon from Mathias Marine Sports. They are interested in a specific model, but it's not available. The agent offers to help them find an alternative or to place an order for 2024. The client expresses their disappointment about not being able to find the desired model and is currently looking for other options.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "negative",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120567.0": {
    "summary": "The client responded with a brief acknowledgment.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120570.0": {
    "summary": "The conversation involves multiple agents from De Mathias Marine Sports responding to various client inquiries. Agent Nicolas is asked to send a photo of his driver's license and vehicle registrations, which he does. Agent Maxime is also asked to send a photo of his vehicle registrations. Agent Marion, the Director of Finance, schedules a meeting to finalize financial transactions and legal modalities. Finally, Agent Alexandre sends a greeting message to Nicolas.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "generally positive, with a few polite requests",
      "agent": "friendly and cooperative"
    },
    "concerned_departments": [
      "Sales",
      "Finance"
    ]
  },
  "120572.0": {
    "summary": "Client asked for a quote and discussed a possible call with the agent, but the details of the quote were not discussed.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120573.0": {
    "summary": "Client De Mathias Marine Sports (Marion Guisiano) inquired about the status of finding a cosignee, inquiring twice about the agent's well-being.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120576.0": {
    "summary": "Client expressed interest in products and asked if there were any questions regarding the pontoon. The client thanked the agent for their interest and ended the conversation positively.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120579.0": {
    "summary": "Client Alexandre Goulet from Mathias Marine Sports had a conversation with Agent Salur, initially inquiring about new products, then canceling a reservation without notice, and expressing frustration about being blocked from booking a machine without a deposit.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "negative",
      "agent": "negative"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120580.0": {
    "summary": "Client Nicolas is inquiring about a VTT and asks if the agent is still looking for one, specifically mentioning models from 2023 or used.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120587.0": {
    "summary": "Client discussed issues with the Four Winns HD3 Surf model's banquette, which does not lie flat and can only be used from one side. Client expressed disappointment and frustration with the design. Agent provided information about the model's features, measurements, and availability, but could not offer alternative deckboat models or solutions to the banquette issue.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "frustrated, disappointed",
      "agent": "helpful, informative"
    },
    "concerned_departments": [
      "Support",
      "Sales",
      "Logistics"
    ]
  },
  "120589.0": {
    "summary": "Client, De Mathias Marine Sports, requested a follow-up on the boat purchase intention.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "inquisitive",
      "agent": "not available"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120590.0": {
    "summary": "Client apologizes for not sending an update and offers the conversation to the agent if they want it, then inquires if the agent received their text.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "apologetic",
      "agent": "not present"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120591.0": {
    "summary": "The client is asking for the total amount and the serial numbers of their product (Mathias Marine Sports) so they can contact the insurance company.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120592.0": {
    "summary": "The client, De Mathias Marine Sports, contacted the agent Yannick to report an issue with the current status, mentioning it is 'orange' with a hint of disappointment.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "negative",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120599.0": {
    "summary": "Client De Mathias Marine Sports (Alexandre Goulet) discussed purchasing a motorcycle with the agent, considering alternative options and financial arrangements. The client ultimately chose to go with their initial reservation due to practicality and ease of access.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support",
      "Sales",
      "Finance"
    ]
  },
  "120613.0": {
    "summary": "The client, De Mathias Marine Sports (Alexandre Goulet), discussed purchasing a motorcycle with the client. The client was interested in financing and would like to speak with the director. The agent agreed to help with the financing and sent a message to the director. However, the client was not satisfied with the price and eventually decided to sell the chenille separately. The conversation ended with the client expressing a positive sentiment towards the agent.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "negative/neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120619.0": {
    "summary": "Client De Mathias Marine Sports (Alexandre Goulet) discussed financing options for a CRF250F motorcycle with agent Zachary. They agreed on the model, discussed payment terms, and made arrangements for a call the next day to finalize the details. The client is excited about purchasing a Honda motorcycle, and the agent appears to be helpful and accommodating.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales",
      "Finance"
    ]
  },
  "120620.0": {
    "summary": "The client, De Mathias Marine Sports, was interested in purchasing a HONDA CRF250F 2023 motorcycle. However, the client had issues with the financing approval and had to provide additional documents to the bank. The client had a conversation with several agents, including Zachary, Alexandre, and Daniel, and ultimately decided to cancel the purchase due to the delay and miscommunication.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "negative",
      "agent": "negative"
    },
    "concerned_departments": [
      "Sales",
      "Logistics",
      "Finance"
    ]
  },
  "120622.0": {
    "summary": "Client De Mathias Marine Sports (Alexandre Goulet) inquired about exchanging his BMW K1600GTL for a KTM Super Duke GT. He had concerns about the price of accessories and requested a discount. The agent, Christian Lauziere, provided quotes and negotiated with his team to offer a discount. The client confirmed receipt of the submitted proposal and made arrangements to pick up the bike and pay the invoice.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales",
      "Logistics"
    ]
  },
  "120625.0": {
    "summary": "The client, Scott, inquired about trading his 2012 Malibu VLX 21 boat with 205 hours against a 2007 SEA RAY SUNDANCER 330. The sales representative, Alexandre, responded with a request for more information, including Scott's best contact time and phone number, and asked for pictures of the boat.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "professional"
    },
    "concerned_departments": [
      "Support",
      "Sales"
    ]
  },
  "120629.0": {
    "summary": "Client Maxime Labbé inquired about a red Sportsman 850 Premium, discussed pricing and visiting the store, and later had a separate conversation with Joly-Ann Hamel about financing for a Polaris Sportsman 850 Ultimate Trail. A reminder of an appointment was sent to the client, and later a confirmation of the same was resent. Alexandre Goulet contacted the client to discuss the appointment time.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales",
      "Finance"
    ]
  },
  "120634.0": {
    "summary": "Client confirmed the reception of a photo and expressed gratitude to the agent, who confirmed the reception of the photo and introduced themselves at the end.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120637.0": {
    "summary": "Client De Mathias Marine Sports (Richard Bourque) expressed gratitude for the agent's visit and provided links to boat products. The client asked a question about the website's hours being displayed in kilometers, which the agent confirmed. The conversation was friendly and positive.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120639.0": {
    "summary": "The client, De Mathias Marine Sports, followed up with the agent Simon about the list of modifications. The agent apologized for not sending it earlier and mentioned that he would send it today, which was accepted by the client.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120643.0": {
    "summary": "Client is unable to access free video content on a platform, specifically boat test videos, and is now restricted due to a paywall.",
    "sentiment_overall": "negative",
    "sentiment_details": {
      "client": "frustrated",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120645.0": {
    "summary": "Client confirmed receipt of something.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120646.0": {
    "summary": "Client, Alexandre Goulet, inquired about a Yamaha FJR1300 used bike. He discussed a potential purchase price of $6000 and financing options. The agent, Alexandre, provided information and negotiated the price. The client ultimately decided to purchase a different bike model, the CRF300 Rally, due to fatigue from the DRZ model.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive (client was pleased with the negotiation and price)",
      "agent": "positive (agent provided helpful information and negotiated the price)"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120654.0": {
    "summary": "The client inquired about a POLARIS General XP 4 1000 Sport model availability at Mathias Sports. The agent, Patrick Audette, confirmed the model's availability and requested a photo of the client's driver's license to proceed with the sale. The client followed up to check on the agent's interest and also mentioned attempting to sell their Yamaha Wolverine Rmax 4 1000 R-Spec 2022.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120656.0": {
    "summary": "Client Maxime Labbé from Mathias Marine Sports asked Alexandra to send a photo of their driver's permit for the OUTLAW 70 Polaris purchase. Client provided contact information for further questions.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "polite",
      "agent": "not present in conversation"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120658.0": {
    "summary": "Client inquired about a Honda 2018 used unit, but was informed it was sold the previous day. Client then offered a Honda Foreman 2010 for trade, but was told that the store does not accept machines over 10 years old and that the Foreman model is only available for pre-order with no delivery date.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "negative (initially positive, but turned negative due to the unit being sold out and the trade offer being rejected)",
      "agent": "positive (provided information and alternatives, but also had to inform the client that their trade offer was not accepted)"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120665.0": {
    "summary": "Client, François, inquired about a motorcycle (FC350) and mentioned his previous vehicle's insurance reimbursement led him to consider purchasing another one. He mentioned a budget of 30-40$/week. The agent, Maxime Labbé, provided his colleague's contact information for financing and attempted to contact François to finalize the sale. However, François ultimately declined the offer.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120670.0": {
    "summary": "Client is offering to sell a vehicle to the agent for $39,000 CAD, including Quebec registration, but does not have a company for export and asks the agent to let them know if they can find a buyer.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120673.0": {
    "summary": "The conversation involves two clients, Alex and Jean-Francois, inquiring about financing and purchasing a motorcycle (initially a Yamaha, but later confirmed to be a Husqvarna FC 350). The clients discuss the financing process, required documents, and insurance. A third client, Joly-Ann Hamel, assists with providing information and clarifying details. The conversation is mostly positive and light-hearted, with the agents being helpful and patient.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive/neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales",
      "Logistics"
    ]
  },
  "120674.0": {
    "summary": "The client, Christophe et Olivier, left a message for Madame Fréchette and provided their contact information via email, suggesting she contact them back through the easiest method for her.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "positive",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120675.0": {
    "summary": "Client Blake Jones inquired about a boat, specifically asking about financing options, and made an unusual question about a decal on the boat's hull. He also asked about the presence of fat sacs on the boat. The conversation was pleasant and light-hearted.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "neutral",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120676.0": {
    "summary": "Client requested information about the exchange process from agent Max.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "frustrated",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120677.0": {
    "summary": "The client, Alexandre Goulet from De Mathias Marine Sports, discussed a purchase with the agent. They finalized the order, including accessories and a speaker system. The client inquired about a different model, but ultimately decided to go with the original order. The agent provided a total price with taxes and ensured that the client had everything needed. The conversation was friendly and the agent provided excellent service.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120679.0": {
    "summary": "Client Kijiji User inquired about a 2006 Four Winns H240 boat, indicated an exchange potential and provided details, also inquired about a potential trade and RV visit. The client is a dealer selling the boat on behalf of a client.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "neutral"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120680.0": {
    "summary": "Client De Mathias Marine Sports inquired about a CRF 250F, inquiring about the price of a winch installation and a hitch in the back, and also requested a tune-up for the vehicle. The agent provided prices and offered to install the winch. The agent also mentioned a 2023 CRF 250F and a 2020 used CRF 250F as alternative options.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120683.0": {
    "summary": "The client, Amor, inquired about a motorcycle model on Kijiji and was contacted by Maxime W Longtin from Mathias sports. They discussed scheduling a call to discuss further details and the client asked about the CC of the motorcycle.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "friendly"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120684.0": {
    "summary": "The client, Nicolas Guignard from De Mathias Marine Sports, contacted to inquire about the Husqvarna FE501s and confirmed receipt of the message.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "neutral",
      "agent": "unavailable"
    },
    "concerned_departments": [
      "Support"
    ]
  },
  "120685.0": {
    "summary": "Client inquired about a used 2008 Tahoe Q4 TOUR DE WAKE boat for sale at Mathias Marine, with a price of $24,900. The agent responded to confirm the client's interest.",
    "sentiment_overall": "neutral",
    "sentiment_details": {
      "client": "interested",
      "agent": "polite and helpful"
    },
    "concerned_departments": [
      "Sales"
    ]
  },
  "120690.0": {
    "summary": "Client submitted a purchase request with a total of $1,975 in discounts. Agent confirmed receipt of the request and sent a follow-up email. Client inquired about the status of the request, and Agent updated the client on the availability of certain parts. Agent also coordinated with the finance department to secure approval for the purchase. A meeting was scheduled for Thursday at 15:00 to finalize the purchase and discuss insurance and direct payment options.",
    "sentiment_overall": "positive",
    "sentiment_details": {
      "client": "positive",
      "agent": "positive"
    },
    "concerned_departments": [
      "Finance"
    ]
  }
}